<!DOCTYPE html><html lang="en" ><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width, initial-scale=1.0"><meta name="generator" content="Jekyll v4.1.0" /><meta property="og:title" content="rohan" /><meta name="author" content="rohan" /><meta property="og:locale" content="en_US" /><meta name="description" content="{ “version”: “https://jsonfeed.org/version/1”, “title”: “rohan”, “home_page_url”: “http://localhost:4000/”, “feed_url”: “http://localhost:4000/feed.json”, “description”: “I have too many hobbies…”, “icon”: “http://localhost:4000/apple-touch-icon.png”, “favicon”: “http://localhost:4000/favicon.ico”, “expired”: false, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null }, “items”: [ { &quot;id&quot;: &quot;http://localhost:4000/2020/08/14/starting-my-game-dev-journey&quot;, &quot;title&quot;: &quot;Starting my game development journey&quot;, &quot;summary&quot;: null, &quot;content_text&quot;: &quot;Part #1 of the gamedev seriesCurrent MoodHello everyone, I have been in front of the computer playing computer games as long as I can remember. My early memories of playing videogames are on the GBA emulator exploring the epic worlds of Pokemon, Beyblade, Dragon Ball Z. I have spent countless hours playing Wild Ambition on my neighbors’ Playstation 1. After countless fights and nirahara samaram (hunger strikes), my dad finally decided to buy us a Playstation 2 but we were a little late to the party cause we got our hands on the PS2 when the PS3 was released but that was okay. PS2 was still damn popular and one of the best consoles yet with an enormous collection of games.At this point, I played games as just games without giving much thought into how it was made. It was around this time I came to know about the best game on the platform - Shadow of the Colossus from the legendary game designer, Fumito Ueda. I did not get a chance to play this on the PS2 but got a chance to play and finish the remade version for the PS4. I was broken. While playing this game, it annoyed me a lot and wondered why this game was so popular. The controls were buggy, the horse is unresponsive and lots of other issues. But in the end, the story slowly starts to come together and bam hits you in the face. The ending left me in tears. The music by Kow Otani, another legend composed a perfect soundtrack for the game. Come to think of it, Fumito intentionally decided to make the agro (the horse) less responsive because if it was like that, then it would be just robotic. He was just trying to emulate the real world. Pets don’t listen to all the time. These minor details got me started about designing games. The art, music, code, story, gameplay which goes into these is insane.I am also a big fan of Hidetaka-san and his work. The Soulsbourne series and Sekiro push the limitation of games. I find many games today not fully utilizing the medium. Videogames are the ultimate form of storytelling and very few designers have harnessed this. Just taking the world of Dark Souls as an example. The game itself offers little to no direct storytelling, meaning cutscenes and dialogues. Everything about the world is immersive. Everything is up to the player, from figuring out the story and what’s happening by observing the world and the mechanics. Games like Ico, SotC, The Last Guardian, etc are benchmarks and push how we tell stories through games.Another inspiration for me is ConcernedApe aka Eric Barone, Chris Sawyer for what they have achieved, technically and artistically. Just to process the fact that Stardew Valley was written entirely by one person is just amazing.Cool, so all these inspired me to make games. But it’s hard for me to even believe that a song inspired me to make the game that I am going to make. Its an album by Sigur Ros called Route One. It is instrumental and plays for 24hrs. There is something very mysterious, eerie about this album that got me to thinking how it would look like on screen. That’s the beauty of art. One medium can inspire another. But then again, everything is art.Buckethead is also a great inspiration. I love mysteries and decoding stuff without someone spoon-feeding me. Not only does this give the player more freedom, but also gives him/her a sense of achievement and satisfaction. Music by Buckethead teaches my to enjoy the little things in life. I started to see the world differently. It’s beauitful how songs with no voals can still have influence.Coming back to the first line, I have been playing games for so long and now, I have decided to finally make mine. I want to do everything by myself from writing the code, creating art and music. I have little knowledge of all the aspects of game design so this would also be a good way to improve.To design a game, you have to be open-minded. I consider myself to be an asshole but every day I am trying to be better. I am. I have been so arrogant and ignorant and every time I think about something bad (that I would never do now), I just want to drop dead. I always hated music other than the traditional stuff, fo example EDM and stuff. I have been such an ignoramus and feel sad and pity for my pas self. I am getting into these things which I would have never done in the past because of my arrogancy. Games like SDV have got me thinking about synth music and its beauty. Everything is beautiful. Everything is different and what makes us different make us beautiful. Many of my friends (I don’t even know how or why they want to be friends with someone like me but I am glad that I am) ask me why I always disappear and I always give some lame reply. But the real reason, I want to get away from my past self and whatever I did. It’s hard to face whatever I did. I want to start fresh. I want to be a ghost.I am not a great artist, heck not even an average one. I am choosing pixel art because the entry-level to that is low compared to high-quality 2d or 3d. I have played guitar for more than 7 years but I am ashamed to say that I don’t know anything about it. I just play. Some people have the natural ability to understand and do. Understand why some things are the way they are.I am afraid that I won’t be able to complete this project. This is a very ambitious one. I am just working on an idea. I have a vision on how the game should play, feel, and look like but do not know how to get there. There is no roadmap, no goals; just progressing step by step. Building as I go in the hope that it will culminate to what my vision is.I am lazier than 99% of the people. I lose motivation very quickly. My attention span is scarily low. For the past couple of months, I have even lost the motivation to wake up. For someone with these traits, it’s hard to create a game. Creating a game is insanely difficult. So, this would be a challenge for me. I quit easily. I do not want to. I am going to set a target and will achieve it even if at any point, I feel like what I am making is terrible and not even worth the time. I need to push myself.I am starting this series to inspire me to keep making the game regardless of people are reading it or not. The more I invest in something, the more it is harder to get out and that is exactly what I am intending to do. I want to put my life into this that it should feel like the game depends on it. I am not looking for any commercial success or fame. I am not doing this to prove anything.I am doing this for myself. To tell myself 20 years from now that I have made something, achieved something in life. Something worthy to even mention because I honestly don’t have anything right now.“We have two lives, and the second begins when we realize we only have one.”― ConfuciusMy only dream and goal before I die is to be genuinely proud of something I create and if brings happiness to others too, I will be thrilled. I also want to make my parents proud who have been supporting me regardless of my ups and downs. I also want it to do it for them.I will be documenting my work once in a while. I have set up the environment. As of now, using Lua and the love2d framework because I found the fairly straightforward. Tried multiple game engines, frameworks but love2d with Lua scored the goal for me. The gameplay style I am going for would be closer to Miyazaki-sans works.&quot;, &quot;content_html&quot;: &quot;&lt;h4 id=\&quot;part-1-of-the-gamedev-series\&quot;&gt;Part #1 of the gamedev series&lt;/h4&gt;&lt;p&gt;Current Mood&lt;/p&gt;&lt;iframe src=\&quot;https://open.spotify.com/embed/track/5GpamlUn0qYsT359B2ogDf\&quot; width=\&quot;100%\&quot; height=\&quot;80\&quot; frameborder=\&quot;0\&quot; allowtransparency=\&quot;true\&quot; allow=\&quot;encrypted-media\&quot;&gt;&lt;/iframe&gt;&lt;p&gt;&lt;br /&gt;&lt;/p&gt;&lt;p&gt;Hello everyone, I have been in front of the computer playing computer games as long as I can remember. My early memories of playing videogames are on the GBA emulator exploring the epic worlds of Pokemon, Beyblade, Dragon Ball Z. I have spent countless hours playing Wild Ambition on my neighbors’ Playstation 1. After countless fights and nirahara samaram (hunger strikes), my dad finally decided to buy us a Playstation 2 but we were a little late to the party cause we got our hands on the PS2 when the PS3 was released but that was okay. PS2 was still damn popular and one of the best consoles yet with an enormous collection of games.&lt;/p&gt;&lt;p&gt;At this point, I played games as just games without giving much thought into how it was made. It was around this time I came to know about the best game on the platform - Shadow of the Colossus from the legendary game designer, Fumito Ueda. I did not get a chance to play this on the PS2 but got a chance to play and finish the remade version for the PS4. I was broken. While playing this game, it annoyed me a lot and wondered why this game was so popular. The controls were buggy, the horse is unresponsive and lots of other issues. But in the end, the story slowly starts to come together and bam hits you in the face. The ending left me in tears. The music by Kow Otani, another legend composed a perfect soundtrack for the game. Come to think of it, Fumito intentionally decided to make the agro (the horse) less responsive because if it was like that, then it would be just robotic. He was just trying to emulate the real world. Pets don’t listen to all the time. These minor details got me started about designing games. The art, music, code, story, gameplay which goes into these is insane.&lt;/p&gt;&lt;p&gt;I am also a big fan of Hidetaka-san and his work. The Soulsbourne series and Sekiro push the limitation of games. I find many games today not fully utilizing the medium. Videogames are the ultimate form of storytelling and very few designers have harnessed this. Just taking the world of Dark Souls as an example. The game itself offers little to no direct storytelling, meaning cutscenes and dialogues. Everything about the world is immersive. Everything is up to the player, from figuring out the story and what’s happening by observing the world and the mechanics. Games like Ico, SotC, The Last Guardian, etc are benchmarks and push how we tell stories through games.&lt;/p&gt;&lt;p&gt;Another inspiration for me is ConcernedApe aka Eric Barone, Chris Sawyer for what they have achieved, technically and artistically. Just to process the fact that Stardew Valley was written entirely by one person is just amazing.&lt;/p&gt;&lt;p&gt;Cool, so all these inspired me to make games. But it’s hard for me to even believe that a song inspired me to make the game that I am going to make. Its an album by Sigur Ros called Route One. It is instrumental and plays for 24hrs. There is something very mysterious, eerie about this album that got me to thinking how it would look like on screen. That’s the beauty of art. One medium can inspire another. But then again, everything is art.&lt;/p&gt;&lt;p&gt;Buckethead is also a great inspiration. I love mysteries and decoding stuff without someone spoon-feeding me. Not only does this give the player more freedom, but also gives him/her a sense of achievement and satisfaction. Music by Buckethead teaches my to enjoy the little things in life. I started to see the world differently. It’s beauitful how songs with no voals can still have influence.&lt;/p&gt;&lt;p&gt;Coming back to the first line, I have been playing games for so long and now, I have decided to finally make mine. I want to do everything by myself from writing the code, creating art and music. I have little knowledge of all the aspects of game design so this would also be a good way to improve.&lt;/p&gt;&lt;p&gt;To design a game, you have to be open-minded. I consider myself to be an asshole but every day I am trying to be better. I am. I have been so arrogant and ignorant and every time I think about something bad (that I would never do now), I just want to drop dead. I always hated music other than the traditional stuff, fo example EDM and stuff. I have been such an ignoramus and feel sad and pity for my pas self. I am getting into these things which I would have never done in the past because of my arrogancy. Games like SDV have got me thinking about synth music and its beauty. Everything is beautiful. Everything is different and what makes us different make us beautiful. Many of my friends (I don’t even know how or why they want to be friends with someone like me but I am glad that I am) ask me why I always disappear and I always give some lame reply. But the real reason, I want to get away from my past self and whatever I did. It’s hard to face whatever I did. I want to start fresh. I want to be a ghost.&lt;/p&gt;&lt;p&gt;I am not a great artist, heck not even an average one. I am choosing pixel art because the entry-level to that is low compared to high-quality 2d or 3d. I have played guitar for more than 7 years but I am ashamed to say that I don’t know anything about it. I just play. Some people have the natural ability to understand and do. Understand why some things are the way they are.&lt;/p&gt;&lt;p&gt;I am afraid that I won’t be able to complete this project. This is a very ambitious one. I am just working on an idea. I have a vision on how the game should play, feel, and look like but do not know how to get there. There is no roadmap, no goals; just progressing step by step. Building as I go in the hope that it will culminate to what my vision is.&lt;/p&gt;&lt;p&gt;I am lazier than 99% of the people. I lose motivation very quickly. My attention span is scarily low. For the past couple of months, I have even lost the motivation to wake up. For someone with these traits, it’s hard to create a game. Creating a game is insanely difficult. So, this would be a challenge for me. I quit easily. I do not want to. I am going to set a target and will achieve it even if at any point, I feel like what I am making is terrible and not even worth the time. I need to push myself.&lt;/p&gt;&lt;p&gt;I am starting this series to inspire me to keep making the game regardless of people are reading it or not. The more I invest in something, the more it is harder to get out and that is exactly what I am intending to do. I want to put my life into this that it should feel like the game depends on it. I am not looking for any commercial success or fame. I am not doing this to prove anything.&lt;/p&gt;&lt;p&gt;I am doing this for myself. To tell myself 20 years from now that I have made something, achieved something in life. Something worthy to even mention because I honestly don’t have anything right now.&lt;/p&gt;&lt;p&gt;“We have two lives, and the second begins when we realize we only have one.”&lt;/p&gt;&lt;p&gt;― Confucius&lt;/p&gt;&lt;p&gt;My only dream and goal before I die is to be genuinely proud of something I create and if brings happiness to others too, I will be thrilled. I also want to make my parents proud who have been supporting me regardless of my ups and downs. I also want it to do it for them.&lt;/p&gt;&lt;p&gt;I will be documenting my work once in a while. I have set up the environment. As of now, using Lua and the love2d framework because I found the fairly straightforward. Tried multiple game engines, frameworks but love2d with Lua scored the goal for me. The gameplay style I am going for would be closer to Miyazaki-sans works.&lt;/p&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/08/14/starting-my-game-dev-journey&quot;, &quot;date_published&quot;: &quot;2020-08-14T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-08-14T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2020/07/28/ban-on-tiktok-and-the-other-chinese-apps&quot;, &quot;title&quot;: &quot;Ban on TikTok and the other Chinese apps&quot;, &quot;summary&quot;: &quot;&quot;, &quot;content_text&quot;: &quot;Before starting, I would like to point that I am not a BJP supporter or any other political party for that matter. I only care about stuff that benefits the interest of India.tl;dr: I fully support the government’s decision of the ban on Chinese apps.Why the ban?All apps on the list are all accused of collecting unauthorized user data (like clipboard and whatnot) and this is not something new.Source 1• Source 2What we don’t know for a fact is whether they are doing this for the interest of a 3rd party, be it any government or corporation but what we do know is that if the government wanted to access this data; by law, they can. Failing to comply with the government puts these companies in trouble because of espionage and national security laws in the country.“The 2017 National Intelligence Law and the 2014 Counter-Espionage Law. Article 7 of the first law states that “any organization or citizen shall support, assist and cooperate with the state intelligence work in accordance with the law.”This ban was proposed/supported/consulted by/with the Cyber Security Team of India (Ministry of Information Technology, Indian Cyber Crime Coordination Centre, Computer Emergency Response Team).People oppossing / ridiculing the ban.Intellectuals opposed Aarogya Setu app, citing &amp;quot;privacy concerns&amp;quot;Its source code is open for everyone to download, examine, redistribute, improve if they wantBut intellectuals are now opposing TikTok ban despite knowing that recently Apple caught TikTok spying on iPhone users&amp;mdash; Anshul Saxena (@AskAnshul) June 30, 2020Why now?Why invite unnecessary attention and issues? Well, no country would do that specifically against a county under normal circumstances.But in my personal opinion, apps like these which pose a threat should be banned regardless of what the situation of the country is, even if its going to attract unwanted attention.Response.This tweet was deleted later. Source: https://twitter.com/shen_shiwei/status/1277631424934240256Should we lecture him about the censorship in China? How can he make such a statement when his own country has one of the world’s most aggressive censorship systems in place, admittedly for one of the reasons as ours.SourceOh wait, forgot that even Wikipedia is blocked. If China ever decides to relieve its censorships, the aforementioned is something you might want to consider reading.&quot;, &quot;content_html&quot;: &quot;&lt;p&gt;Before starting, I would like to point that I am not a BJP supporter or any other political party for that matter. I only care about stuff that benefits the interest of India.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;tl;dr: I fully support the government’s decision of the ban on Chinese apps.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Why the ban?&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;All apps on the list are all accused of collecting unauthorized user data (like clipboard and whatnot) and this is not something new.&lt;/p&gt;&lt;p&gt;&lt;a href=\&quot;https://www.forbes.com/sites/zakdoffman/2020/06/26/warning-apple-suddenly-catches-tiktok-secretly-spying-on-millions-of-iphone-users/#6f048e5b34ef\&quot;&gt;Source 1&lt;/a&gt;• &lt;a href=\&quot;https://www.businesstoday.in/technology/news/tiktok-secretly-accesses-users-data-apple-catches-it-red-handed/story/408359.html\&quot;&gt;Source 2&lt;/a&gt;&lt;/p&gt;&lt;p&gt;What we don’t know for a fact is whether they are doing this for the interest of a 3rd party, be it any government or corporation but what we do know is that if the government wanted to access this data; by law, they can. Failing to comply with the government puts these companies in trouble because of espionage and national security laws in the country.&lt;/p&gt;&lt;p&gt;&lt;em&gt;“The 2017 National Intelligence Law and the 2014 Counter-Espionage Law. Article 7 of the first law states that “any organization or citizen shall support, assist and cooperate with the state intelligence work in accordance with the law.”&lt;/em&gt;&lt;/p&gt;&lt;p&gt;This ban was proposed/supported/consulted by/with the Cyber Security Team of India (Ministry of Information Technology, Indian Cyber Crime Coordination Centre, Computer Emergency Response Team).&lt;/p&gt;&lt;p&gt;&lt;strong&gt;People oppossing / ridiculing the ban.&lt;/strong&gt;&lt;/p&gt;&lt;blockquote class=\&quot;twitter-tweet\&quot;&gt;&lt;p lang=\&quot;en\&quot; dir=\&quot;ltr\&quot;&gt;Intellectuals opposed Aarogya Setu app, citing &amp;quot;privacy concerns&amp;quot;&lt;br /&gt;&lt;br /&gt;Its source code is open for everyone to download, examine, redistribute, improve if they want&lt;br /&gt;&lt;br /&gt;But intellectuals are now opposing TikTok ban despite knowing that recently Apple caught TikTok spying on iPhone users&lt;/p&gt;&amp;mdash; Anshul Saxena (@AskAnshul) &lt;a href=\&quot;https://twitter.com/AskAnshul/status/1277871856666636288?ref_src=twsrc%5Etfw\&quot;&gt;June 30, 2020&lt;/a&gt;&lt;/blockquote&gt;&lt;script async=\&quot;\&quot; src=\&quot;https://platform.twitter.com/widgets.js\&quot; charset=\&quot;utf-8\&quot;&gt;&lt;/script&gt;&lt;p&gt;&lt;strong&gt;Why now?&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Why invite unnecessary attention and issues? Well, no country would do that specifically against a county under normal circumstances.&lt;/p&gt;&lt;p&gt;But in my personal opinion, apps like these which pose a threat should be banned regardless of what the situation of the country is, even if its going to attract unwanted attention.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Response.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\&quot;/uploads/186abd5b5784ccce53367bc3ae165c60-1.png\&quot; alt=\&quot;\&quot; /&gt;&lt;/p&gt;&lt;p&gt;This tweet was deleted later. Source: &lt;a href=\&quot;https://twitter.com/shen_shiwei/status/1277631424934240256\&quot; title=\&quot;https://twitter.com/shen_shiwei/status/1277631424934240256\&quot;&gt;https://twitter.com/shen_shiwei/status/1277631424934240256&lt;/a&gt;&lt;/p&gt;&lt;p&gt;Should we lecture him about the censorship in China? How can he make such a statement when his own country has one of the world’s most aggressive censorship systems in place, admittedly for one of the reasons as ours.&lt;/p&gt;&lt;p&gt;&lt;a href=\&quot;https://en.wikipedia.org/wiki/List_of_websites_blocked_in_mainland_China\&quot;&gt;Source&lt;/a&gt;&lt;/p&gt;&lt;p&gt;Oh wait, forgot that even Wikipedia is blocked. If China ever decides to relieve its censorships, the aforementioned is something you might want to consider reading.&lt;/p&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/07/28/ban-on-tiktok-and-the-other-chinese-apps&quot;, &quot;date_published&quot;: &quot;2020-07-28T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-07-28T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2020/07/14/pocket-money&quot;, &quot;title&quot;: &quot;Pocket money&quot;, &quot;summary&quot;: &quot;&quot;, &quot;content_text&quot;: &quot;This first thing that comes to my mind when I think about pocket money is Vishu which is a festival we celebrate in Kerala. On this day, there is a tradition of giving young people money. Although Vishu marks the first day of Medam, the ninth month in the Malayalam calendar (yes, I googled this), I believe this day also signifies the rotation of wealth.Writing this stuff brings back so many memories. The day starts by our mom (we are 2 siblings) waking us up early in the morning and telling us to keep our eyes closed as she takes us to show us the statue of a Hindu deity decorated with flowers and other beautiful articles. Then she hands each of us a rupee note (of 100/500 denomination). That’s how the day starts!We were a tightly packed society meaning all my friends were in the same neighborhood. So after receiving these “vishumoney” (this is what we used to call it) from our dad and grandparents we would run off to our friends’ house.P.S (but not really) grandparents used to give us the largest amount.You can think of it like Halloween but instead of candies, its money and exclusive to Kerala. At the end of the day, me and and brother would add our “collections” and make a list on what to spend it on. If we were unable to spend it on anything, we would just return it to our parents i.e after Vishu of course!I didn’t require any “pocket money” in my childhood as everything was available and provided at home only.In the old days, elder people used to only give coins to younger folk but you know these days, because of inflation and all… (͡ ° ͜ʖ ͡ °)&quot;, &quot;content_html&quot;: &quot;&lt;p&gt;This first thing that comes to my mind when I think about pocket money is Vishu which is a festival we celebrate in Kerala. On this day, there is a tradition of giving young people money. Although Vishu marks the first day of Medam, the ninth month in the Malayalam calendar (yes, I googled this), I believe this day also signifies the rotation of wealth.&lt;/p&gt;&lt;p&gt;Writing this stuff brings back so many memories. The day starts by our mom (we are 2 siblings) waking us up early in the morning and telling us to keep our eyes closed as she takes us to show us the statue of a Hindu deity decorated with flowers and other beautiful articles. Then she hands each of us a rupee note (of 100/500 denomination). That’s how the day starts!&lt;/p&gt;&lt;p&gt;We were a tightly packed society meaning all my friends were in the same neighborhood. So after receiving these “vishumoney” (this is what we used to call it) from our dad and grandparents we would run off to our friends’ house.&lt;/p&gt;&lt;p&gt;P.S (but not really) grandparents used to give us the largest amount.&lt;/p&gt;&lt;p&gt;You can think of it like Halloween but instead of candies, its money and exclusive to Kerala. At the end of the day, me and and brother would add our “collections” and make a list on what to spend it on. If we were unable to spend it on anything, we would just return it to our parents i.e after Vishu of course!&lt;/p&gt;&lt;p&gt;I didn’t require any “pocket money” in my childhood as everything was available and provided at home only.&lt;/p&gt;&lt;p&gt;In the old days, elder people used to only give coins to younger folk but you know these days, because of inflation and all… (͡ ° ͜ʖ ͡ °)&lt;/p&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/07/14/pocket-money&quot;, &quot;date_published&quot;: &quot;2020-07-14T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-07-14T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2020/06/11/show-latest-commit-svelte&quot;, &quot;title&quot;: &quot;Show latest commit on Svelte&quot;, &quot;summary&quot;: null, &quot;content_text&quot;: &quot;Scroll down for full codeOutputcommit 72ea82sImport onMount from Svelteimport { onMount } from &#39;svelte&#39;onMount runs immediately after the component is rendered to the DOM.Write a simple fetch function to fetch from the Github APISo here we are telling Svelte to fetch some data from this API when the component is first rendered. Note that the functions inside the onMount is only triggered when it enters the DOM.onMount(async () =&amp;gt; { await fetch(&#39;https://api.github.com/repos/${userName}/${repoName}/commits&#39;) .then((response) =&amp;gt; response.json()) .then((data) =&amp;gt; { id = data[0].sha.slice(0, 7) })})await fetch(&#39;https://api.github.com/repos/${userName}/${repoName}/commits&#39;)Performs a fetch request to the Github API’s. Replace this userName and repoName with yours..then((response) =&amp;gt; response.json())Converts the response to .json objects..then((data) =&amp;gt; {id = data[0].sha.slice(0, 7)})Assigning only the first index data[0] sha key (where our commit id is) to a variable id since our request returned an array of objects with all the commits and info.slice(0,7)Takes only the first 7 digits since it is the Git default for a short SHAFull Code&quot;, &quot;content_html&quot;: &quot;&lt;h4 id=\&quot;scroll-down-for-full-code\&quot;&gt;&lt;a href=\&quot;#full-code\&quot;&gt;Scroll down for full code&lt;/a&gt;&lt;/h4&gt;&lt;h4 id=\&quot;output\&quot;&gt;Output&lt;/h4&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;commit 72ea82s&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;import-onmount-from-svelte\&quot;&gt;Import onMount from Svelte&lt;/h4&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;import { onMount } from &#39;svelte&#39;&lt;/code&gt;&lt;/p&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;onMount&lt;/code&gt; runs immediately after the component is rendered to the DOM.&lt;/p&gt;&lt;h4 id=\&quot;write-a-simple-fetch-function-to-fetch-from-the-github-api\&quot;&gt;Write a simple fetch function to fetch from the Github API&lt;/h4&gt;&lt;p&gt;So here we are telling Svelte to fetch some data from this API when the component is first rendered. Note that the functions inside the &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;onMount&lt;/code&gt; is only triggered when it enters the DOM.&lt;/p&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;onMount(async () =&amp;gt; { await fetch(&#39;https://api.github.com/repos/${userName}/${repoName}/commits&#39;) .then((response) =&amp;gt; response.json()) .then((data) =&amp;gt; { id = data[0].sha.slice(0, 7) })})&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;await fetch(&#39;https://api.github.com/repos/${userName}/${repoName}/commits&#39;)&lt;/code&gt;Performs a fetch request to the Github API’s. Replace this &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;userName&lt;/code&gt; and &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;repoName&lt;/code&gt; with yours.&lt;/p&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;.then((response) =&amp;gt; response.json())&lt;/code&gt;&lt;br /&gt;Converts the response to &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;.json&lt;/code&gt; objects.&lt;/p&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;.then((data) =&amp;gt; {id = data[0].sha.slice(0, 7)})&lt;/code&gt;&lt;br /&gt;Assigning only the first index &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;data[0]&lt;/code&gt; &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;sha&lt;/code&gt; key (where our commit id is) to a variable &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;id&lt;/code&gt; since our request returned an array of objects with all the commits and info.&lt;/p&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;slice(0,7)&lt;/code&gt;&lt;br /&gt;Takes only the first 7 digits since it is the Git default for a short SHA&lt;/p&gt;&lt;h4 id=\&quot;full-code\&quot;&gt;&lt;a name=\&quot;full-code\&quot;&gt;Full Code&lt;/a&gt;&lt;/h4&gt;&lt;script src=\&quot;https://gist.github.com/rohanharikr/aef6d401adc26f403efe98d6238602d4.js\&quot;&gt;&lt;/script&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/06/11/show-latest-commit-svelte&quot;, &quot;date_published&quot;: &quot;2020-06-11T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-06-11T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2020/06/02/rock-paper-scissors-javascript&quot;, &quot;title&quot;: &quot;Rock, paper, scissors, javascript&quot;, &quot;summary&quot;: null, &quot;content_text&quot;: &quot;Scroll down for full codeOutput// Pass a choice as an argument to the main function.You chose paper and computer chose rock.You win!Create an array of all possible choicesconst choices = [\&quot;rock\&quot;, \&quot;paper\&quot;, \&quot;scissors\&quot;]Random ChoiceThis would give us a random number between 1 and the array length which in this case happens to be 3.Math.floor(Math.random() * choices.length)Main functionThe Random Choice code is put inside a function because ideally, every time this function is called, a new choice would be generated.function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`)...}MatchmakingFirst things first, let’s consider all the tie cases.function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`) \tif (userChoice === computerChoice) { console.log(\&quot;It&#39;s a tie!\&quot;) }...}All the cases when your choice is rockif (userChoice === \&quot;rock\&quot;) {\tif (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You won!\&quot;) }Repeat for other n choices; this case, twoif (userChoice === \&quot;paper\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You won!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You lost!\&quot;) }}if (userChoice === \&quot;scissors\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You won!\&quot;) }}Optimise by writing all the cases in one blockif (userChoice === computerChoice) { console.log(\&quot;It&#39;s a tie!\&quot;) } else if (userChoice === \&quot;rock\&quot;) { if (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You won!\&quot;) } } else if (userChoice === \&quot;paper\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You won!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You lost!\&quot;) } } else if (userChoice === \&quot;scissors\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You won!\&quot;) } }Full Code&quot;, &quot;content_html&quot;: &quot;&lt;h4 id=\&quot;scroll-down-for-full-code\&quot;&gt;&lt;a href=\&quot;#full-code\&quot;&gt;Scroll down for full code&lt;/a&gt;&lt;/h4&gt;&lt;h4 id=\&quot;output\&quot;&gt;Output&lt;/h4&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;// Pass a choice as an argument to the main function.You chose paper and computer chose rock.You win!&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;create-an-array-of-all-possible-choices\&quot;&gt;Create an array of all possible choices&lt;/h4&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;const choices = [\&quot;rock\&quot;, \&quot;paper\&quot;, \&quot;scissors\&quot;]&lt;/code&gt;&lt;/p&gt;&lt;h4 id=\&quot;random-choice\&quot;&gt;Random Choice&lt;/h4&gt;&lt;p&gt;This would give us a random number between 1 and the array length which in this case happens to be 3.&lt;/p&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;Math.floor(Math.random() * choices.length)&lt;/code&gt;&lt;/p&gt;&lt;h4 id=\&quot;main-function\&quot;&gt;Main function&lt;/h4&gt;&lt;p&gt;The &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;Random Choice&lt;/code&gt; code is put inside a function because ideally, every time this function is called, a new choice would be generated.&lt;/p&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`)...}&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;matchmaking\&quot;&gt;Matchmaking&lt;/h4&gt;&lt;p&gt;First things first, let’s consider all the tie cases.&lt;/p&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`) \tif (userChoice === computerChoice) { console.log(\&quot;It&#39;s a tie!\&quot;) }...}&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;all-the-cases-when-your-choice-is-rock\&quot;&gt;All the cases when your choice is rock&lt;/h4&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;if (userChoice === \&quot;rock\&quot;) {\tif (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You won!\&quot;) }&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;repeat-for-other-n-choices-this-case-two\&quot;&gt;Repeat for other n choices; this case, two&lt;/h4&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;if (userChoice === \&quot;paper\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You won!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You lost!\&quot;) }}if (userChoice === \&quot;scissors\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You won!\&quot;) }}&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;optimise-by-writing-all-the-cases-in-one-block\&quot;&gt;Optimise by writing all the cases in one block&lt;/h4&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;if (userChoice === computerChoice) { console.log(\&quot;It&#39;s a tie!\&quot;) } else if (userChoice === \&quot;rock\&quot;) { if (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You won!\&quot;) } } else if (userChoice === \&quot;paper\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You won!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You lost!\&quot;) } } else if (userChoice === \&quot;scissors\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You won!\&quot;) } }&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;full-code\&quot;&gt;&lt;a name=\&quot;full-code\&quot;&gt;Full Code&lt;/a&gt;&lt;/h4&gt;&lt;script src=\&quot;https://gist.github.com/rohanharikr/8bfbd1471389e795b436cd87ab09a444.js\&quot;&gt;&lt;/script&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/06/02/rock-paper-scissors-javascript&quot;, &quot;date_published&quot;: &quot;2020-06-02T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-06-02T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2019/04/05/see-who-liked-you-without-tinder-gold&quot;, &quot;title&quot;: &quot;See who liked you without Tinder Gold&quot;, &quot;summary&quot;: &quot;What is the difference between various font formats?&quot;, &quot;content_text&quot;: &quot;ResultImages of people who liked you at 640x800, 320x400, 172x216 without Tinder Gold.SoTinder likes without Gold comes up like this, a blur effect on the photo(s). \tInitially, I thought that the blurred images were sent from their servers itself.A simple inspection on the code-webkit-filter: blur(8px)filter: blur(8px)Okay, so they are applying a blur effect with CSS. Disabling this would give me a raw image of 172x216 dimension. Exploring media items, the recently liked (only one) would be of 320x400 dimension.https://preview.gotinder.com/18d6e533-c874-48ad-ac66-ae6b63aa77fb/172x216_c77f0e5c-40b4-4af4-9b68-5f0ff26ead90.jpgThe 172x216 in the URL is the dimensions. Changing it to 320x400, would give me an image of that dimension. All the images were coming from the same endpoint. So, I tried changing it to random dimensions with the same aspect ratio which like I guessed didn’t work because they were not storing (x dimension) in their server.Also, noticed that my profile picture was of better quality.To my surprise, that too was coming from the same endpoint. So, now I know that Tinder stores images in 640x800 also.So, that’s that.&quot;, &quot;content_html&quot;: &quot;&lt;h4 id=\&quot;result\&quot;&gt;Result&lt;/h4&gt;&lt;p&gt;Images of people who liked you at 640x800, 320x400, 172x216 without Tinder Gold.&lt;/p&gt;&lt;p&gt;&lt;img src=\&quot;../../../assets/images/result.png\&quot; alt=\&quot;\&quot; /&gt;&lt;/p&gt;&lt;p&gt;&lt;br /&gt;&lt;/p&gt;&lt;h4 id=\&quot;so\&quot;&gt;So&lt;/h4&gt;&lt;p&gt;Tinder likes without Gold comes up like this, a blur effect on the photo(s).&lt;/p&gt;&lt;p&gt;&lt;img src=\&quot;../../../assets/images/tindergold.png\&quot; alt=\&quot;\&quot; /&gt; \tInitially, I thought that the blurred images were sent from their servers itself.A simple inspection on the code&lt;/p&gt;&lt;div class=\&quot;language-html highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;-webkit-filter: blur(8px)filter: blur(8px)&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;Okay, so they are applying a blur effect with CSS. Disabling this would give me a raw image of 172x216 dimension. Exploring media items, the recently liked (only one) would be of 320x400 dimension.&lt;/p&gt;&lt;div class=\&quot;language-html highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;https://preview.gotinder.com/18d6e533-c874-48ad-ac66-ae6b63aa77fb/172x216_c77f0e5c-40b4-4af4-9b68-5f0ff26ead90.jpg&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;The 172x216 in the URL is the dimensions. Changing it to 320x400, would give me an image of that dimension. All the images were coming from the same endpoint. So, I tried changing it to random dimensions with the same aspect ratio which like I guessed didn’t work because they were not storing (x dimension) in their server.&lt;/p&gt;&lt;p&gt;&lt;img src=\&quot;../../../assets/images/error.png\&quot; alt=\&quot;\&quot; /&gt;&lt;/p&gt;&lt;p&gt;Also, noticed that my profile picture was of better quality.&lt;/p&gt;&lt;p&gt;&lt;img src=\&quot;../../../assets/images/profile.png\&quot; alt=\&quot;\&quot; /&gt;&lt;/p&gt;&lt;p&gt;To my surprise, that too was coming from the same endpoint. So, now I know that Tinder stores images in 640x800 also.&lt;/p&gt;&lt;p&gt;So, that’s that.&lt;/p&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2019/04/05/see-who-liked-you-without-tinder-gold&quot;, &quot;date_published&quot;: &quot;2019-04-05T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2019-04-05T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } } ] }" /><meta property="og:description" content="{ “version”: “https://jsonfeed.org/version/1”, “title”: “rohan”, “home_page_url”: “http://localhost:4000/”, “feed_url”: “http://localhost:4000/feed.json”, “description”: “I have too many hobbies…”, “icon”: “http://localhost:4000/apple-touch-icon.png”, “favicon”: “http://localhost:4000/favicon.ico”, “expired”: false, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null }, “items”: [ { &quot;id&quot;: &quot;http://localhost:4000/2020/08/14/starting-my-game-dev-journey&quot;, &quot;title&quot;: &quot;Starting my game development journey&quot;, &quot;summary&quot;: null, &quot;content_text&quot;: &quot;Part #1 of the gamedev seriesCurrent MoodHello everyone, I have been in front of the computer playing computer games as long as I can remember. My early memories of playing videogames are on the GBA emulator exploring the epic worlds of Pokemon, Beyblade, Dragon Ball Z. I have spent countless hours playing Wild Ambition on my neighbors’ Playstation 1. After countless fights and nirahara samaram (hunger strikes), my dad finally decided to buy us a Playstation 2 but we were a little late to the party cause we got our hands on the PS2 when the PS3 was released but that was okay. PS2 was still damn popular and one of the best consoles yet with an enormous collection of games.At this point, I played games as just games without giving much thought into how it was made. It was around this time I came to know about the best game on the platform - Shadow of the Colossus from the legendary game designer, Fumito Ueda. I did not get a chance to play this on the PS2 but got a chance to play and finish the remade version for the PS4. I was broken. While playing this game, it annoyed me a lot and wondered why this game was so popular. The controls were buggy, the horse is unresponsive and lots of other issues. But in the end, the story slowly starts to come together and bam hits you in the face. The ending left me in tears. The music by Kow Otani, another legend composed a perfect soundtrack for the game. Come to think of it, Fumito intentionally decided to make the agro (the horse) less responsive because if it was like that, then it would be just robotic. He was just trying to emulate the real world. Pets don’t listen to all the time. These minor details got me started about designing games. The art, music, code, story, gameplay which goes into these is insane.I am also a big fan of Hidetaka-san and his work. The Soulsbourne series and Sekiro push the limitation of games. I find many games today not fully utilizing the medium. Videogames are the ultimate form of storytelling and very few designers have harnessed this. Just taking the world of Dark Souls as an example. The game itself offers little to no direct storytelling, meaning cutscenes and dialogues. Everything about the world is immersive. Everything is up to the player, from figuring out the story and what’s happening by observing the world and the mechanics. Games like Ico, SotC, The Last Guardian, etc are benchmarks and push how we tell stories through games.Another inspiration for me is ConcernedApe aka Eric Barone, Chris Sawyer for what they have achieved, technically and artistically. Just to process the fact that Stardew Valley was written entirely by one person is just amazing.Cool, so all these inspired me to make games. But it’s hard for me to even believe that a song inspired me to make the game that I am going to make. Its an album by Sigur Ros called Route One. It is instrumental and plays for 24hrs. There is something very mysterious, eerie about this album that got me to thinking how it would look like on screen. That’s the beauty of art. One medium can inspire another. But then again, everything is art.Buckethead is also a great inspiration. I love mysteries and decoding stuff without someone spoon-feeding me. Not only does this give the player more freedom, but also gives him/her a sense of achievement and satisfaction. Music by Buckethead teaches my to enjoy the little things in life. I started to see the world differently. It’s beauitful how songs with no voals can still have influence.Coming back to the first line, I have been playing games for so long and now, I have decided to finally make mine. I want to do everything by myself from writing the code, creating art and music. I have little knowledge of all the aspects of game design so this would also be a good way to improve.To design a game, you have to be open-minded. I consider myself to be an asshole but every day I am trying to be better. I am. I have been so arrogant and ignorant and every time I think about something bad (that I would never do now), I just want to drop dead. I always hated music other than the traditional stuff, fo example EDM and stuff. I have been such an ignoramus and feel sad and pity for my pas self. I am getting into these things which I would have never done in the past because of my arrogancy. Games like SDV have got me thinking about synth music and its beauty. Everything is beautiful. Everything is different and what makes us different make us beautiful. Many of my friends (I don’t even know how or why they want to be friends with someone like me but I am glad that I am) ask me why I always disappear and I always give some lame reply. But the real reason, I want to get away from my past self and whatever I did. It’s hard to face whatever I did. I want to start fresh. I want to be a ghost.I am not a great artist, heck not even an average one. I am choosing pixel art because the entry-level to that is low compared to high-quality 2d or 3d. I have played guitar for more than 7 years but I am ashamed to say that I don’t know anything about it. I just play. Some people have the natural ability to understand and do. Understand why some things are the way they are.I am afraid that I won’t be able to complete this project. This is a very ambitious one. I am just working on an idea. I have a vision on how the game should play, feel, and look like but do not know how to get there. There is no roadmap, no goals; just progressing step by step. Building as I go in the hope that it will culminate to what my vision is.I am lazier than 99% of the people. I lose motivation very quickly. My attention span is scarily low. For the past couple of months, I have even lost the motivation to wake up. For someone with these traits, it’s hard to create a game. Creating a game is insanely difficult. So, this would be a challenge for me. I quit easily. I do not want to. I am going to set a target and will achieve it even if at any point, I feel like what I am making is terrible and not even worth the time. I need to push myself.I am starting this series to inspire me to keep making the game regardless of people are reading it or not. The more I invest in something, the more it is harder to get out and that is exactly what I am intending to do. I want to put my life into this that it should feel like the game depends on it. I am not looking for any commercial success or fame. I am not doing this to prove anything.I am doing this for myself. To tell myself 20 years from now that I have made something, achieved something in life. Something worthy to even mention because I honestly don’t have anything right now.“We have two lives, and the second begins when we realize we only have one.”― ConfuciusMy only dream and goal before I die is to be genuinely proud of something I create and if brings happiness to others too, I will be thrilled. I also want to make my parents proud who have been supporting me regardless of my ups and downs. I also want it to do it for them.I will be documenting my work once in a while. I have set up the environment. As of now, using Lua and the love2d framework because I found the fairly straightforward. Tried multiple game engines, frameworks but love2d with Lua scored the goal for me. The gameplay style I am going for would be closer to Miyazaki-sans works.&quot;, &quot;content_html&quot;: &quot;&lt;h4 id=\&quot;part-1-of-the-gamedev-series\&quot;&gt;Part #1 of the gamedev series&lt;/h4&gt;&lt;p&gt;Current Mood&lt;/p&gt;&lt;iframe src=\&quot;https://open.spotify.com/embed/track/5GpamlUn0qYsT359B2ogDf\&quot; width=\&quot;100%\&quot; height=\&quot;80\&quot; frameborder=\&quot;0\&quot; allowtransparency=\&quot;true\&quot; allow=\&quot;encrypted-media\&quot;&gt;&lt;/iframe&gt;&lt;p&gt;&lt;br /&gt;&lt;/p&gt;&lt;p&gt;Hello everyone, I have been in front of the computer playing computer games as long as I can remember. My early memories of playing videogames are on the GBA emulator exploring the epic worlds of Pokemon, Beyblade, Dragon Ball Z. I have spent countless hours playing Wild Ambition on my neighbors’ Playstation 1. After countless fights and nirahara samaram (hunger strikes), my dad finally decided to buy us a Playstation 2 but we were a little late to the party cause we got our hands on the PS2 when the PS3 was released but that was okay. PS2 was still damn popular and one of the best consoles yet with an enormous collection of games.&lt;/p&gt;&lt;p&gt;At this point, I played games as just games without giving much thought into how it was made. It was around this time I came to know about the best game on the platform - Shadow of the Colossus from the legendary game designer, Fumito Ueda. I did not get a chance to play this on the PS2 but got a chance to play and finish the remade version for the PS4. I was broken. While playing this game, it annoyed me a lot and wondered why this game was so popular. The controls were buggy, the horse is unresponsive and lots of other issues. But in the end, the story slowly starts to come together and bam hits you in the face. The ending left me in tears. The music by Kow Otani, another legend composed a perfect soundtrack for the game. Come to think of it, Fumito intentionally decided to make the agro (the horse) less responsive because if it was like that, then it would be just robotic. He was just trying to emulate the real world. Pets don’t listen to all the time. These minor details got me started about designing games. The art, music, code, story, gameplay which goes into these is insane.&lt;/p&gt;&lt;p&gt;I am also a big fan of Hidetaka-san and his work. The Soulsbourne series and Sekiro push the limitation of games. I find many games today not fully utilizing the medium. Videogames are the ultimate form of storytelling and very few designers have harnessed this. Just taking the world of Dark Souls as an example. The game itself offers little to no direct storytelling, meaning cutscenes and dialogues. Everything about the world is immersive. Everything is up to the player, from figuring out the story and what’s happening by observing the world and the mechanics. Games like Ico, SotC, The Last Guardian, etc are benchmarks and push how we tell stories through games.&lt;/p&gt;&lt;p&gt;Another inspiration for me is ConcernedApe aka Eric Barone, Chris Sawyer for what they have achieved, technically and artistically. Just to process the fact that Stardew Valley was written entirely by one person is just amazing.&lt;/p&gt;&lt;p&gt;Cool, so all these inspired me to make games. But it’s hard for me to even believe that a song inspired me to make the game that I am going to make. Its an album by Sigur Ros called Route One. It is instrumental and plays for 24hrs. There is something very mysterious, eerie about this album that got me to thinking how it would look like on screen. That’s the beauty of art. One medium can inspire another. But then again, everything is art.&lt;/p&gt;&lt;p&gt;Buckethead is also a great inspiration. I love mysteries and decoding stuff without someone spoon-feeding me. Not only does this give the player more freedom, but also gives him/her a sense of achievement and satisfaction. Music by Buckethead teaches my to enjoy the little things in life. I started to see the world differently. It’s beauitful how songs with no voals can still have influence.&lt;/p&gt;&lt;p&gt;Coming back to the first line, I have been playing games for so long and now, I have decided to finally make mine. I want to do everything by myself from writing the code, creating art and music. I have little knowledge of all the aspects of game design so this would also be a good way to improve.&lt;/p&gt;&lt;p&gt;To design a game, you have to be open-minded. I consider myself to be an asshole but every day I am trying to be better. I am. I have been so arrogant and ignorant and every time I think about something bad (that I would never do now), I just want to drop dead. I always hated music other than the traditional stuff, fo example EDM and stuff. I have been such an ignoramus and feel sad and pity for my pas self. I am getting into these things which I would have never done in the past because of my arrogancy. Games like SDV have got me thinking about synth music and its beauty. Everything is beautiful. Everything is different and what makes us different make us beautiful. Many of my friends (I don’t even know how or why they want to be friends with someone like me but I am glad that I am) ask me why I always disappear and I always give some lame reply. But the real reason, I want to get away from my past self and whatever I did. It’s hard to face whatever I did. I want to start fresh. I want to be a ghost.&lt;/p&gt;&lt;p&gt;I am not a great artist, heck not even an average one. I am choosing pixel art because the entry-level to that is low compared to high-quality 2d or 3d. I have played guitar for more than 7 years but I am ashamed to say that I don’t know anything about it. I just play. Some people have the natural ability to understand and do. Understand why some things are the way they are.&lt;/p&gt;&lt;p&gt;I am afraid that I won’t be able to complete this project. This is a very ambitious one. I am just working on an idea. I have a vision on how the game should play, feel, and look like but do not know how to get there. There is no roadmap, no goals; just progressing step by step. Building as I go in the hope that it will culminate to what my vision is.&lt;/p&gt;&lt;p&gt;I am lazier than 99% of the people. I lose motivation very quickly. My attention span is scarily low. For the past couple of months, I have even lost the motivation to wake up. For someone with these traits, it’s hard to create a game. Creating a game is insanely difficult. So, this would be a challenge for me. I quit easily. I do not want to. I am going to set a target and will achieve it even if at any point, I feel like what I am making is terrible and not even worth the time. I need to push myself.&lt;/p&gt;&lt;p&gt;I am starting this series to inspire me to keep making the game regardless of people are reading it or not. The more I invest in something, the more it is harder to get out and that is exactly what I am intending to do. I want to put my life into this that it should feel like the game depends on it. I am not looking for any commercial success or fame. I am not doing this to prove anything.&lt;/p&gt;&lt;p&gt;I am doing this for myself. To tell myself 20 years from now that I have made something, achieved something in life. Something worthy to even mention because I honestly don’t have anything right now.&lt;/p&gt;&lt;p&gt;“We have two lives, and the second begins when we realize we only have one.”&lt;/p&gt;&lt;p&gt;― Confucius&lt;/p&gt;&lt;p&gt;My only dream and goal before I die is to be genuinely proud of something I create and if brings happiness to others too, I will be thrilled. I also want to make my parents proud who have been supporting me regardless of my ups and downs. I also want it to do it for them.&lt;/p&gt;&lt;p&gt;I will be documenting my work once in a while. I have set up the environment. As of now, using Lua and the love2d framework because I found the fairly straightforward. Tried multiple game engines, frameworks but love2d with Lua scored the goal for me. The gameplay style I am going for would be closer to Miyazaki-sans works.&lt;/p&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/08/14/starting-my-game-dev-journey&quot;, &quot;date_published&quot;: &quot;2020-08-14T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-08-14T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2020/07/28/ban-on-tiktok-and-the-other-chinese-apps&quot;, &quot;title&quot;: &quot;Ban on TikTok and the other Chinese apps&quot;, &quot;summary&quot;: &quot;&quot;, &quot;content_text&quot;: &quot;Before starting, I would like to point that I am not a BJP supporter or any other political party for that matter. I only care about stuff that benefits the interest of India.tl;dr: I fully support the government’s decision of the ban on Chinese apps.Why the ban?All apps on the list are all accused of collecting unauthorized user data (like clipboard and whatnot) and this is not something new.Source 1• Source 2What we don’t know for a fact is whether they are doing this for the interest of a 3rd party, be it any government or corporation but what we do know is that if the government wanted to access this data; by law, they can. Failing to comply with the government puts these companies in trouble because of espionage and national security laws in the country.“The 2017 National Intelligence Law and the 2014 Counter-Espionage Law. Article 7 of the first law states that “any organization or citizen shall support, assist and cooperate with the state intelligence work in accordance with the law.”This ban was proposed/supported/consulted by/with the Cyber Security Team of India (Ministry of Information Technology, Indian Cyber Crime Coordination Centre, Computer Emergency Response Team).People oppossing / ridiculing the ban.Intellectuals opposed Aarogya Setu app, citing &amp;quot;privacy concerns&amp;quot;Its source code is open for everyone to download, examine, redistribute, improve if they wantBut intellectuals are now opposing TikTok ban despite knowing that recently Apple caught TikTok spying on iPhone users&amp;mdash; Anshul Saxena (@AskAnshul) June 30, 2020Why now?Why invite unnecessary attention and issues? Well, no country would do that specifically against a county under normal circumstances.But in my personal opinion, apps like these which pose a threat should be banned regardless of what the situation of the country is, even if its going to attract unwanted attention.Response.This tweet was deleted later. Source: https://twitter.com/shen_shiwei/status/1277631424934240256Should we lecture him about the censorship in China? How can he make such a statement when his own country has one of the world’s most aggressive censorship systems in place, admittedly for one of the reasons as ours.SourceOh wait, forgot that even Wikipedia is blocked. If China ever decides to relieve its censorships, the aforementioned is something you might want to consider reading.&quot;, &quot;content_html&quot;: &quot;&lt;p&gt;Before starting, I would like to point that I am not a BJP supporter or any other political party for that matter. I only care about stuff that benefits the interest of India.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;tl;dr: I fully support the government’s decision of the ban on Chinese apps.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Why the ban?&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;All apps on the list are all accused of collecting unauthorized user data (like clipboard and whatnot) and this is not something new.&lt;/p&gt;&lt;p&gt;&lt;a href=\&quot;https://www.forbes.com/sites/zakdoffman/2020/06/26/warning-apple-suddenly-catches-tiktok-secretly-spying-on-millions-of-iphone-users/#6f048e5b34ef\&quot;&gt;Source 1&lt;/a&gt;• &lt;a href=\&quot;https://www.businesstoday.in/technology/news/tiktok-secretly-accesses-users-data-apple-catches-it-red-handed/story/408359.html\&quot;&gt;Source 2&lt;/a&gt;&lt;/p&gt;&lt;p&gt;What we don’t know for a fact is whether they are doing this for the interest of a 3rd party, be it any government or corporation but what we do know is that if the government wanted to access this data; by law, they can. Failing to comply with the government puts these companies in trouble because of espionage and national security laws in the country.&lt;/p&gt;&lt;p&gt;&lt;em&gt;“The 2017 National Intelligence Law and the 2014 Counter-Espionage Law. Article 7 of the first law states that “any organization or citizen shall support, assist and cooperate with the state intelligence work in accordance with the law.”&lt;/em&gt;&lt;/p&gt;&lt;p&gt;This ban was proposed/supported/consulted by/with the Cyber Security Team of India (Ministry of Information Technology, Indian Cyber Crime Coordination Centre, Computer Emergency Response Team).&lt;/p&gt;&lt;p&gt;&lt;strong&gt;People oppossing / ridiculing the ban.&lt;/strong&gt;&lt;/p&gt;&lt;blockquote class=\&quot;twitter-tweet\&quot;&gt;&lt;p lang=\&quot;en\&quot; dir=\&quot;ltr\&quot;&gt;Intellectuals opposed Aarogya Setu app, citing &amp;quot;privacy concerns&amp;quot;&lt;br /&gt;&lt;br /&gt;Its source code is open for everyone to download, examine, redistribute, improve if they want&lt;br /&gt;&lt;br /&gt;But intellectuals are now opposing TikTok ban despite knowing that recently Apple caught TikTok spying on iPhone users&lt;/p&gt;&amp;mdash; Anshul Saxena (@AskAnshul) &lt;a href=\&quot;https://twitter.com/AskAnshul/status/1277871856666636288?ref_src=twsrc%5Etfw\&quot;&gt;June 30, 2020&lt;/a&gt;&lt;/blockquote&gt;&lt;script async=\&quot;\&quot; src=\&quot;https://platform.twitter.com/widgets.js\&quot; charset=\&quot;utf-8\&quot;&gt;&lt;/script&gt;&lt;p&gt;&lt;strong&gt;Why now?&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Why invite unnecessary attention and issues? Well, no country would do that specifically against a county under normal circumstances.&lt;/p&gt;&lt;p&gt;But in my personal opinion, apps like these which pose a threat should be banned regardless of what the situation of the country is, even if its going to attract unwanted attention.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Response.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\&quot;/uploads/186abd5b5784ccce53367bc3ae165c60-1.png\&quot; alt=\&quot;\&quot; /&gt;&lt;/p&gt;&lt;p&gt;This tweet was deleted later. Source: &lt;a href=\&quot;https://twitter.com/shen_shiwei/status/1277631424934240256\&quot; title=\&quot;https://twitter.com/shen_shiwei/status/1277631424934240256\&quot;&gt;https://twitter.com/shen_shiwei/status/1277631424934240256&lt;/a&gt;&lt;/p&gt;&lt;p&gt;Should we lecture him about the censorship in China? How can he make such a statement when his own country has one of the world’s most aggressive censorship systems in place, admittedly for one of the reasons as ours.&lt;/p&gt;&lt;p&gt;&lt;a href=\&quot;https://en.wikipedia.org/wiki/List_of_websites_blocked_in_mainland_China\&quot;&gt;Source&lt;/a&gt;&lt;/p&gt;&lt;p&gt;Oh wait, forgot that even Wikipedia is blocked. If China ever decides to relieve its censorships, the aforementioned is something you might want to consider reading.&lt;/p&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/07/28/ban-on-tiktok-and-the-other-chinese-apps&quot;, &quot;date_published&quot;: &quot;2020-07-28T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-07-28T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2020/07/14/pocket-money&quot;, &quot;title&quot;: &quot;Pocket money&quot;, &quot;summary&quot;: &quot;&quot;, &quot;content_text&quot;: &quot;This first thing that comes to my mind when I think about pocket money is Vishu which is a festival we celebrate in Kerala. On this day, there is a tradition of giving young people money. Although Vishu marks the first day of Medam, the ninth month in the Malayalam calendar (yes, I googled this), I believe this day also signifies the rotation of wealth.Writing this stuff brings back so many memories. The day starts by our mom (we are 2 siblings) waking us up early in the morning and telling us to keep our eyes closed as she takes us to show us the statue of a Hindu deity decorated with flowers and other beautiful articles. Then she hands each of us a rupee note (of 100/500 denomination). That’s how the day starts!We were a tightly packed society meaning all my friends were in the same neighborhood. So after receiving these “vishumoney” (this is what we used to call it) from our dad and grandparents we would run off to our friends’ house.P.S (but not really) grandparents used to give us the largest amount.You can think of it like Halloween but instead of candies, its money and exclusive to Kerala. At the end of the day, me and and brother would add our “collections” and make a list on what to spend it on. If we were unable to spend it on anything, we would just return it to our parents i.e after Vishu of course!I didn’t require any “pocket money” in my childhood as everything was available and provided at home only.In the old days, elder people used to only give coins to younger folk but you know these days, because of inflation and all… (͡ ° ͜ʖ ͡ °)&quot;, &quot;content_html&quot;: &quot;&lt;p&gt;This first thing that comes to my mind when I think about pocket money is Vishu which is a festival we celebrate in Kerala. On this day, there is a tradition of giving young people money. Although Vishu marks the first day of Medam, the ninth month in the Malayalam calendar (yes, I googled this), I believe this day also signifies the rotation of wealth.&lt;/p&gt;&lt;p&gt;Writing this stuff brings back so many memories. The day starts by our mom (we are 2 siblings) waking us up early in the morning and telling us to keep our eyes closed as she takes us to show us the statue of a Hindu deity decorated with flowers and other beautiful articles. Then she hands each of us a rupee note (of 100/500 denomination). That’s how the day starts!&lt;/p&gt;&lt;p&gt;We were a tightly packed society meaning all my friends were in the same neighborhood. So after receiving these “vishumoney” (this is what we used to call it) from our dad and grandparents we would run off to our friends’ house.&lt;/p&gt;&lt;p&gt;P.S (but not really) grandparents used to give us the largest amount.&lt;/p&gt;&lt;p&gt;You can think of it like Halloween but instead of candies, its money and exclusive to Kerala. At the end of the day, me and and brother would add our “collections” and make a list on what to spend it on. If we were unable to spend it on anything, we would just return it to our parents i.e after Vishu of course!&lt;/p&gt;&lt;p&gt;I didn’t require any “pocket money” in my childhood as everything was available and provided at home only.&lt;/p&gt;&lt;p&gt;In the old days, elder people used to only give coins to younger folk but you know these days, because of inflation and all… (͡ ° ͜ʖ ͡ °)&lt;/p&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/07/14/pocket-money&quot;, &quot;date_published&quot;: &quot;2020-07-14T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-07-14T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2020/06/11/show-latest-commit-svelte&quot;, &quot;title&quot;: &quot;Show latest commit on Svelte&quot;, &quot;summary&quot;: null, &quot;content_text&quot;: &quot;Scroll down for full codeOutputcommit 72ea82sImport onMount from Svelteimport { onMount } from &#39;svelte&#39;onMount runs immediately after the component is rendered to the DOM.Write a simple fetch function to fetch from the Github APISo here we are telling Svelte to fetch some data from this API when the component is first rendered. Note that the functions inside the onMount is only triggered when it enters the DOM.onMount(async () =&amp;gt; { await fetch(&#39;https://api.github.com/repos/${userName}/${repoName}/commits&#39;) .then((response) =&amp;gt; response.json()) .then((data) =&amp;gt; { id = data[0].sha.slice(0, 7) })})await fetch(&#39;https://api.github.com/repos/${userName}/${repoName}/commits&#39;)Performs a fetch request to the Github API’s. Replace this userName and repoName with yours..then((response) =&amp;gt; response.json())Converts the response to .json objects..then((data) =&amp;gt; {id = data[0].sha.slice(0, 7)})Assigning only the first index data[0] sha key (where our commit id is) to a variable id since our request returned an array of objects with all the commits and info.slice(0,7)Takes only the first 7 digits since it is the Git default for a short SHAFull Code&quot;, &quot;content_html&quot;: &quot;&lt;h4 id=\&quot;scroll-down-for-full-code\&quot;&gt;&lt;a href=\&quot;#full-code\&quot;&gt;Scroll down for full code&lt;/a&gt;&lt;/h4&gt;&lt;h4 id=\&quot;output\&quot;&gt;Output&lt;/h4&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;commit 72ea82s&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;import-onmount-from-svelte\&quot;&gt;Import onMount from Svelte&lt;/h4&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;import { onMount } from &#39;svelte&#39;&lt;/code&gt;&lt;/p&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;onMount&lt;/code&gt; runs immediately after the component is rendered to the DOM.&lt;/p&gt;&lt;h4 id=\&quot;write-a-simple-fetch-function-to-fetch-from-the-github-api\&quot;&gt;Write a simple fetch function to fetch from the Github API&lt;/h4&gt;&lt;p&gt;So here we are telling Svelte to fetch some data from this API when the component is first rendered. Note that the functions inside the &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;onMount&lt;/code&gt; is only triggered when it enters the DOM.&lt;/p&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;onMount(async () =&amp;gt; { await fetch(&#39;https://api.github.com/repos/${userName}/${repoName}/commits&#39;) .then((response) =&amp;gt; response.json()) .then((data) =&amp;gt; { id = data[0].sha.slice(0, 7) })})&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;await fetch(&#39;https://api.github.com/repos/${userName}/${repoName}/commits&#39;)&lt;/code&gt;Performs a fetch request to the Github API’s. Replace this &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;userName&lt;/code&gt; and &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;repoName&lt;/code&gt; with yours.&lt;/p&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;.then((response) =&amp;gt; response.json())&lt;/code&gt;&lt;br /&gt;Converts the response to &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;.json&lt;/code&gt; objects.&lt;/p&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;.then((data) =&amp;gt; {id = data[0].sha.slice(0, 7)})&lt;/code&gt;&lt;br /&gt;Assigning only the first index &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;data[0]&lt;/code&gt; &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;sha&lt;/code&gt; key (where our commit id is) to a variable &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;id&lt;/code&gt; since our request returned an array of objects with all the commits and info.&lt;/p&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;slice(0,7)&lt;/code&gt;&lt;br /&gt;Takes only the first 7 digits since it is the Git default for a short SHA&lt;/p&gt;&lt;h4 id=\&quot;full-code\&quot;&gt;&lt;a name=\&quot;full-code\&quot;&gt;Full Code&lt;/a&gt;&lt;/h4&gt;&lt;script src=\&quot;https://gist.github.com/rohanharikr/aef6d401adc26f403efe98d6238602d4.js\&quot;&gt;&lt;/script&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/06/11/show-latest-commit-svelte&quot;, &quot;date_published&quot;: &quot;2020-06-11T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-06-11T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2020/06/02/rock-paper-scissors-javascript&quot;, &quot;title&quot;: &quot;Rock, paper, scissors, javascript&quot;, &quot;summary&quot;: null, &quot;content_text&quot;: &quot;Scroll down for full codeOutput// Pass a choice as an argument to the main function.You chose paper and computer chose rock.You win!Create an array of all possible choicesconst choices = [\&quot;rock\&quot;, \&quot;paper\&quot;, \&quot;scissors\&quot;]Random ChoiceThis would give us a random number between 1 and the array length which in this case happens to be 3.Math.floor(Math.random() * choices.length)Main functionThe Random Choice code is put inside a function because ideally, every time this function is called, a new choice would be generated.function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`)...}MatchmakingFirst things first, let’s consider all the tie cases.function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`) \tif (userChoice === computerChoice) { console.log(\&quot;It&#39;s a tie!\&quot;) }...}All the cases when your choice is rockif (userChoice === \&quot;rock\&quot;) {\tif (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You won!\&quot;) }Repeat for other n choices; this case, twoif (userChoice === \&quot;paper\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You won!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You lost!\&quot;) }}if (userChoice === \&quot;scissors\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You won!\&quot;) }}Optimise by writing all the cases in one blockif (userChoice === computerChoice) { console.log(\&quot;It&#39;s a tie!\&quot;) } else if (userChoice === \&quot;rock\&quot;) { if (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You won!\&quot;) } } else if (userChoice === \&quot;paper\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You won!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You lost!\&quot;) } } else if (userChoice === \&quot;scissors\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You won!\&quot;) } }Full Code&quot;, &quot;content_html&quot;: &quot;&lt;h4 id=\&quot;scroll-down-for-full-code\&quot;&gt;&lt;a href=\&quot;#full-code\&quot;&gt;Scroll down for full code&lt;/a&gt;&lt;/h4&gt;&lt;h4 id=\&quot;output\&quot;&gt;Output&lt;/h4&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;// Pass a choice as an argument to the main function.You chose paper and computer chose rock.You win!&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;create-an-array-of-all-possible-choices\&quot;&gt;Create an array of all possible choices&lt;/h4&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;const choices = [\&quot;rock\&quot;, \&quot;paper\&quot;, \&quot;scissors\&quot;]&lt;/code&gt;&lt;/p&gt;&lt;h4 id=\&quot;random-choice\&quot;&gt;Random Choice&lt;/h4&gt;&lt;p&gt;This would give us a random number between 1 and the array length which in this case happens to be 3.&lt;/p&gt;&lt;p&gt;&lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;Math.floor(Math.random() * choices.length)&lt;/code&gt;&lt;/p&gt;&lt;h4 id=\&quot;main-function\&quot;&gt;Main function&lt;/h4&gt;&lt;p&gt;The &lt;code class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;Random Choice&lt;/code&gt; code is put inside a function because ideally, every time this function is called, a new choice would be generated.&lt;/p&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`)...}&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;matchmaking\&quot;&gt;Matchmaking&lt;/h4&gt;&lt;p&gt;First things first, let’s consider all the tie cases.&lt;/p&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`) \tif (userChoice === computerChoice) { console.log(\&quot;It&#39;s a tie!\&quot;) }...}&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;all-the-cases-when-your-choice-is-rock\&quot;&gt;All the cases when your choice is rock&lt;/h4&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;if (userChoice === \&quot;rock\&quot;) {\tif (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You won!\&quot;) }&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;repeat-for-other-n-choices-this-case-two\&quot;&gt;Repeat for other n choices; this case, two&lt;/h4&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;if (userChoice === \&quot;paper\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You won!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You lost!\&quot;) }}if (userChoice === \&quot;scissors\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You won!\&quot;) }}&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;optimise-by-writing-all-the-cases-in-one-block\&quot;&gt;Optimise by writing all the cases in one block&lt;/h4&gt;&lt;div class=\&quot;language-plaintext highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;if (userChoice === computerChoice) { console.log(\&quot;It&#39;s a tie!\&quot;) } else if (userChoice === \&quot;rock\&quot;) { if (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You won!\&quot;) } } else if (userChoice === \&quot;paper\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You won!\&quot;) } else if (computerChoice === \&quot;scissors\&quot;) { console.log(\&quot;You lost!\&quot;) } } else if (userChoice === \&quot;scissors\&quot;) { if (computerChoice === \&quot;rock\&quot;) { console.log(\&quot;You lost!\&quot;) } else if (computerChoice === \&quot;paper\&quot;) { console.log(\&quot;You won!\&quot;) } }&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\&quot;full-code\&quot;&gt;&lt;a name=\&quot;full-code\&quot;&gt;Full Code&lt;/a&gt;&lt;/h4&gt;&lt;script src=\&quot;https://gist.github.com/rohanharikr/8bfbd1471389e795b436cd87ab09a444.js\&quot;&gt;&lt;/script&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/06/02/rock-paper-scissors-javascript&quot;, &quot;date_published&quot;: &quot;2020-06-02T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-06-02T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2019/04/05/see-who-liked-you-without-tinder-gold&quot;, &quot;title&quot;: &quot;See who liked you without Tinder Gold&quot;, &quot;summary&quot;: &quot;What is the difference between various font formats?&quot;, &quot;content_text&quot;: &quot;ResultImages of people who liked you at 640x800, 320x400, 172x216 without Tinder Gold.SoTinder likes without Gold comes up like this, a blur effect on the photo(s). \tInitially, I thought that the blurred images were sent from their servers itself.A simple inspection on the code-webkit-filter: blur(8px)filter: blur(8px)Okay, so they are applying a blur effect with CSS. Disabling this would give me a raw image of 172x216 dimension. Exploring media items, the recently liked (only one) would be of 320x400 dimension.https://preview.gotinder.com/18d6e533-c874-48ad-ac66-ae6b63aa77fb/172x216_c77f0e5c-40b4-4af4-9b68-5f0ff26ead90.jpgThe 172x216 in the URL is the dimensions. Changing it to 320x400, would give me an image of that dimension. All the images were coming from the same endpoint. So, I tried changing it to random dimensions with the same aspect ratio which like I guessed didn’t work because they were not storing (x dimension) in their server.Also, noticed that my profile picture was of better quality.To my surprise, that too was coming from the same endpoint. So, now I know that Tinder stores images in 640x800 also.So, that’s that.&quot;, &quot;content_html&quot;: &quot;&lt;h4 id=\&quot;result\&quot;&gt;Result&lt;/h4&gt;&lt;p&gt;Images of people who liked you at 640x800, 320x400, 172x216 without Tinder Gold.&lt;/p&gt;&lt;p&gt;&lt;img src=\&quot;../../../assets/images/result.png\&quot; alt=\&quot;\&quot; /&gt;&lt;/p&gt;&lt;p&gt;&lt;br /&gt;&lt;/p&gt;&lt;h4 id=\&quot;so\&quot;&gt;So&lt;/h4&gt;&lt;p&gt;Tinder likes without Gold comes up like this, a blur effect on the photo(s).&lt;/p&gt;&lt;p&gt;&lt;img src=\&quot;../../../assets/images/tindergold.png\&quot; alt=\&quot;\&quot; /&gt; \tInitially, I thought that the blurred images were sent from their servers itself.A simple inspection on the code&lt;/p&gt;&lt;div class=\&quot;language-html highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;-webkit-filter: blur(8px)filter: blur(8px)&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;Okay, so they are applying a blur effect with CSS. Disabling this would give me a raw image of 172x216 dimension. Exploring media items, the recently liked (only one) would be of 320x400 dimension.&lt;/p&gt;&lt;div class=\&quot;language-html highlighter-rouge\&quot;&gt;&lt;div class=\&quot;highlight\&quot;&gt;&lt;pre class=\&quot;highlight\&quot;&gt;&lt;code&gt;https://preview.gotinder.com/18d6e533-c874-48ad-ac66-ae6b63aa77fb/172x216_c77f0e5c-40b4-4af4-9b68-5f0ff26ead90.jpg&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;The 172x216 in the URL is the dimensions. Changing it to 320x400, would give me an image of that dimension. All the images were coming from the same endpoint. So, I tried changing it to random dimensions with the same aspect ratio which like I guessed didn’t work because they were not storing (x dimension) in their server.&lt;/p&gt;&lt;p&gt;&lt;img src=\&quot;../../../assets/images/error.png\&quot; alt=\&quot;\&quot; /&gt;&lt;/p&gt;&lt;p&gt;Also, noticed that my profile picture was of better quality.&lt;/p&gt;&lt;p&gt;&lt;img src=\&quot;../../../assets/images/profile.png\&quot; alt=\&quot;\&quot; /&gt;&lt;/p&gt;&lt;p&gt;To my surprise, that too was coming from the same endpoint. So, now I know that Tinder stores images in 640x800 also.&lt;/p&gt;&lt;p&gt;So, that’s that.&lt;/p&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2019/04/05/see-who-liked-you-without-tinder-gold&quot;, &quot;date_published&quot;: &quot;2019-04-05T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2019-04-05T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } } ] }" /><link rel="canonical" href="http://localhost:4000/feed.json" /><meta property="og:url" content="http://localhost:4000/feed.json" /><meta property="og:site_name" content="rohan" /><meta name="twitter:card" content="summary" /><meta property="twitter:title" content="rohan" /><meta name="twitter:site" content="@rohanharikr" /><meta name="twitter:creator" content="@rohanharikr" /> <script type="application/ld+json"> {"author":{"@type":"Person","name":"rohan"},"description":"{ “version”: “https://jsonfeed.org/version/1”, “title”: “rohan”, “home_page_url”: “http://localhost:4000/”, “feed_url”: “http://localhost:4000/feed.json”, “description”: “I have too many hobbies…”, “icon”: “http://localhost:4000/apple-touch-icon.png”, “favicon”: “http://localhost:4000/favicon.ico”, “expired”: false, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null }, “items”: [ { &quot;id&quot;: &quot;http://localhost:4000/2020/08/14/starting-my-game-dev-journey&quot;, &quot;title&quot;: &quot;Starting my game development journey&quot;, &quot;summary&quot;: null, &quot;content_text&quot;: &quot;Part #1 of the gamedev seriesCurrent MoodHello everyone, I have been in front of the computer playing computer games as long as I can remember. My early memories of playing videogames are on the GBA emulator exploring the epic worlds of Pokemon, Beyblade, Dragon Ball Z. I have spent countless hours playing Wild Ambition on my neighbors’ Playstation 1. After countless fights and nirahara samaram (hunger strikes), my dad finally decided to buy us a Playstation 2 but we were a little late to the party cause we got our hands on the PS2 when the PS3 was released but that was okay. PS2 was still damn popular and one of the best consoles yet with an enormous collection of games.At this point, I played games as just games without giving much thought into how it was made. It was around this time I came to know about the best game on the platform - Shadow of the Colossus from the legendary game designer, Fumito Ueda. I did not get a chance to play this on the PS2 but got a chance to play and finish the remade version for the PS4. I was broken. While playing this game, it annoyed me a lot and wondered why this game was so popular. The controls were buggy, the horse is unresponsive and lots of other issues. But in the end, the story slowly starts to come together and bam hits you in the face. The ending left me in tears. The music by Kow Otani, another legend composed a perfect soundtrack for the game. Come to think of it, Fumito intentionally decided to make the agro (the horse) less responsive because if it was like that, then it would be just robotic. He was just trying to emulate the real world. Pets don’t listen to all the time. These minor details got me started about designing games. The art, music, code, story, gameplay which goes into these is insane.I am also a big fan of Hidetaka-san and his work. The Soulsbourne series and Sekiro push the limitation of games. I find many games today not fully utilizing the medium. Videogames are the ultimate form of storytelling and very few designers have harnessed this. Just taking the world of Dark Souls as an example. The game itself offers little to no direct storytelling, meaning cutscenes and dialogues. Everything about the world is immersive. Everything is up to the player, from figuring out the story and what’s happening by observing the world and the mechanics. Games like Ico, SotC, The Last Guardian, etc are benchmarks and push how we tell stories through games.Another inspiration for me is ConcernedApe aka Eric Barone, Chris Sawyer for what they have achieved, technically and artistically. Just to process the fact that Stardew Valley was written entirely by one person is just amazing.Cool, so all these inspired me to make games. But it’s hard for me to even believe that a song inspired me to make the game that I am going to make. Its an album by Sigur Ros called Route One. It is instrumental and plays for 24hrs. There is something very mysterious, eerie about this album that got me to thinking how it would look like on screen. That’s the beauty of art. One medium can inspire another. But then again, everything is art.Buckethead is also a great inspiration. I love mysteries and decoding stuff without someone spoon-feeding me. Not only does this give the player more freedom, but also gives him/her a sense of achievement and satisfaction. Music by Buckethead teaches my to enjoy the little things in life. I started to see the world differently. It’s beauitful how songs with no voals can still have influence.Coming back to the first line, I have been playing games for so long and now, I have decided to finally make mine. I want to do everything by myself from writing the code, creating art and music. I have little knowledge of all the aspects of game design so this would also be a good way to improve.To design a game, you have to be open-minded. I consider myself to be an asshole but every day I am trying to be better. I am. I have been so arrogant and ignorant and every time I think about something bad (that I would never do now), I just want to drop dead. I always hated music other than the traditional stuff, fo example EDM and stuff. I have been such an ignoramus and feel sad and pity for my pas self. I am getting into these things which I would have never done in the past because of my arrogancy. Games like SDV have got me thinking about synth music and its beauty. Everything is beautiful. Everything is different and what makes us different make us beautiful. Many of my friends (I don’t even know how or why they want to be friends with someone like me but I am glad that I am) ask me why I always disappear and I always give some lame reply. But the real reason, I want to get away from my past self and whatever I did. It’s hard to face whatever I did. I want to start fresh. I want to be a ghost.I am not a great artist, heck not even an average one. I am choosing pixel art because the entry-level to that is low compared to high-quality 2d or 3d. I have played guitar for more than 7 years but I am ashamed to say that I don’t know anything about it. I just play. Some people have the natural ability to understand and do. Understand why some things are the way they are.I am afraid that I won’t be able to complete this project. This is a very ambitious one. I am just working on an idea. I have a vision on how the game should play, feel, and look like but do not know how to get there. There is no roadmap, no goals; just progressing step by step. Building as I go in the hope that it will culminate to what my vision is.I am lazier than 99% of the people. I lose motivation very quickly. My attention span is scarily low. For the past couple of months, I have even lost the motivation to wake up. For someone with these traits, it’s hard to create a game. Creating a game is insanely difficult. So, this would be a challenge for me. I quit easily. I do not want to. I am going to set a target and will achieve it even if at any point, I feel like what I am making is terrible and not even worth the time. I need to push myself.I am starting this series to inspire me to keep making the game regardless of people are reading it or not. The more I invest in something, the more it is harder to get out and that is exactly what I am intending to do. I want to put my life into this that it should feel like the game depends on it. I am not looking for any commercial success or fame. I am not doing this to prove anything.I am doing this for myself. To tell myself 20 years from now that I have made something, achieved something in life. Something worthy to even mention because I honestly don’t have anything right now.“We have two lives, and the second begins when we realize we only have one.”― ConfuciusMy only dream and goal before I die is to be genuinely proud of something I create and if brings happiness to others too, I will be thrilled. I also want to make my parents proud who have been supporting me regardless of my ups and downs. I also want it to do it for them.I will be documenting my work once in a while. I have set up the environment. As of now, using Lua and the love2d framework because I found the fairly straightforward. Tried multiple game engines, frameworks but love2d with Lua scored the goal for me. The gameplay style I am going for would be closer to Miyazaki-sans works.&quot;, &quot;content_html&quot;: &quot;&lt;h4 id=\\&quot;part-1-of-the-gamedev-series\\&quot;&gt;Part #1 of the gamedev series&lt;/h4&gt;&lt;p&gt;Current Mood&lt;/p&gt;&lt;iframe src=\\&quot;https://open.spotify.com/embed/track/5GpamlUn0qYsT359B2ogDf\\&quot; width=\\&quot;100%\\&quot; height=\\&quot;80\\&quot; frameborder=\\&quot;0\\&quot; allowtransparency=\\&quot;true\\&quot; allow=\\&quot;encrypted-media\\&quot;&gt;&lt;/iframe&gt;&lt;p&gt;&lt;br /&gt;&lt;/p&gt;&lt;p&gt;Hello everyone, I have been in front of the computer playing computer games as long as I can remember. My early memories of playing videogames are on the GBA emulator exploring the epic worlds of Pokemon, Beyblade, Dragon Ball Z. I have spent countless hours playing Wild Ambition on my neighbors’ Playstation 1. After countless fights and nirahara samaram (hunger strikes), my dad finally decided to buy us a Playstation 2 but we were a little late to the party cause we got our hands on the PS2 when the PS3 was released but that was okay. PS2 was still damn popular and one of the best consoles yet with an enormous collection of games.&lt;/p&gt;&lt;p&gt;At this point, I played games as just games without giving much thought into how it was made. It was around this time I came to know about the best game on the platform - Shadow of the Colossus from the legendary game designer, Fumito Ueda. I did not get a chance to play this on the PS2 but got a chance to play and finish the remade version for the PS4. I was broken. While playing this game, it annoyed me a lot and wondered why this game was so popular. The controls were buggy, the horse is unresponsive and lots of other issues. But in the end, the story slowly starts to come together and bam hits you in the face. The ending left me in tears. The music by Kow Otani, another legend composed a perfect soundtrack for the game. Come to think of it, Fumito intentionally decided to make the agro (the horse) less responsive because if it was like that, then it would be just robotic. He was just trying to emulate the real world. Pets don’t listen to all the time. These minor details got me started about designing games. The art, music, code, story, gameplay which goes into these is insane.&lt;/p&gt;&lt;p&gt;I am also a big fan of Hidetaka-san and his work. The Soulsbourne series and Sekiro push the limitation of games. I find many games today not fully utilizing the medium. Videogames are the ultimate form of storytelling and very few designers have harnessed this. Just taking the world of Dark Souls as an example. The game itself offers little to no direct storytelling, meaning cutscenes and dialogues. Everything about the world is immersive. Everything is up to the player, from figuring out the story and what’s happening by observing the world and the mechanics. Games like Ico, SotC, The Last Guardian, etc are benchmarks and push how we tell stories through games.&lt;/p&gt;&lt;p&gt;Another inspiration for me is ConcernedApe aka Eric Barone, Chris Sawyer for what they have achieved, technically and artistically. Just to process the fact that Stardew Valley was written entirely by one person is just amazing.&lt;/p&gt;&lt;p&gt;Cool, so all these inspired me to make games. But it’s hard for me to even believe that a song inspired me to make the game that I am going to make. Its an album by Sigur Ros called Route One. It is instrumental and plays for 24hrs. There is something very mysterious, eerie about this album that got me to thinking how it would look like on screen. That’s the beauty of art. One medium can inspire another. But then again, everything is art.&lt;/p&gt;&lt;p&gt;Buckethead is also a great inspiration. I love mysteries and decoding stuff without someone spoon-feeding me. Not only does this give the player more freedom, but also gives him/her a sense of achievement and satisfaction. Music by Buckethead teaches my to enjoy the little things in life. I started to see the world differently. It’s beauitful how songs with no voals can still have influence.&lt;/p&gt;&lt;p&gt;Coming back to the first line, I have been playing games for so long and now, I have decided to finally make mine. I want to do everything by myself from writing the code, creating art and music. I have little knowledge of all the aspects of game design so this would also be a good way to improve.&lt;/p&gt;&lt;p&gt;To design a game, you have to be open-minded. I consider myself to be an asshole but every day I am trying to be better. I am. I have been so arrogant and ignorant and every time I think about something bad (that I would never do now), I just want to drop dead. I always hated music other than the traditional stuff, fo example EDM and stuff. I have been such an ignoramus and feel sad and pity for my pas self. I am getting into these things which I would have never done in the past because of my arrogancy. Games like SDV have got me thinking about synth music and its beauty. Everything is beautiful. Everything is different and what makes us different make us beautiful. Many of my friends (I don’t even know how or why they want to be friends with someone like me but I am glad that I am) ask me why I always disappear and I always give some lame reply. But the real reason, I want to get away from my past self and whatever I did. It’s hard to face whatever I did. I want to start fresh. I want to be a ghost.&lt;/p&gt;&lt;p&gt;I am not a great artist, heck not even an average one. I am choosing pixel art because the entry-level to that is low compared to high-quality 2d or 3d. I have played guitar for more than 7 years but I am ashamed to say that I don’t know anything about it. I just play. Some people have the natural ability to understand and do. Understand why some things are the way they are.&lt;/p&gt;&lt;p&gt;I am afraid that I won’t be able to complete this project. This is a very ambitious one. I am just working on an idea. I have a vision on how the game should play, feel, and look like but do not know how to get there. There is no roadmap, no goals; just progressing step by step. Building as I go in the hope that it will culminate to what my vision is.&lt;/p&gt;&lt;p&gt;I am lazier than 99% of the people. I lose motivation very quickly. My attention span is scarily low. For the past couple of months, I have even lost the motivation to wake up. For someone with these traits, it’s hard to create a game. Creating a game is insanely difficult. So, this would be a challenge for me. I quit easily. I do not want to. I am going to set a target and will achieve it even if at any point, I feel like what I am making is terrible and not even worth the time. I need to push myself.&lt;/p&gt;&lt;p&gt;I am starting this series to inspire me to keep making the game regardless of people are reading it or not. The more I invest in something, the more it is harder to get out and that is exactly what I am intending to do. I want to put my life into this that it should feel like the game depends on it. I am not looking for any commercial success or fame. I am not doing this to prove anything.&lt;/p&gt;&lt;p&gt;I am doing this for myself. To tell myself 20 years from now that I have made something, achieved something in life. Something worthy to even mention because I honestly don’t have anything right now.&lt;/p&gt;&lt;p&gt;“We have two lives, and the second begins when we realize we only have one.”&lt;/p&gt;&lt;p&gt;― Confucius&lt;/p&gt;&lt;p&gt;My only dream and goal before I die is to be genuinely proud of something I create and if brings happiness to others too, I will be thrilled. I also want to make my parents proud who have been supporting me regardless of my ups and downs. I also want it to do it for them.&lt;/p&gt;&lt;p&gt;I will be documenting my work once in a while. I have set up the environment. As of now, using Lua and the love2d framework because I found the fairly straightforward. Tried multiple game engines, frameworks but love2d with Lua scored the goal for me. The gameplay style I am going for would be closer to Miyazaki-sans works.&lt;/p&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/08/14/starting-my-game-dev-journey&quot;, &quot;date_published&quot;: &quot;2020-08-14T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-08-14T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2020/07/28/ban-on-tiktok-and-the-other-chinese-apps&quot;, &quot;title&quot;: &quot;Ban on TikTok and the other Chinese apps&quot;, &quot;summary&quot;: &quot;&quot;, &quot;content_text&quot;: &quot;Before starting, I would like to point that I am not a BJP supporter or any other political party for that matter. I only care about stuff that benefits the interest of India.tl;dr: I fully support the government’s decision of the ban on Chinese apps.Why the ban?All apps on the list are all accused of collecting unauthorized user data (like clipboard and whatnot) and this is not something new.Source 1• Source 2What we don’t know for a fact is whether they are doing this for the interest of a 3rd party, be it any government or corporation but what we do know is that if the government wanted to access this data; by law, they can. Failing to comply with the government puts these companies in trouble because of espionage and national security laws in the country.“The 2017 National Intelligence Law and the 2014 Counter-Espionage Law. Article 7 of the first law states that “any organization or citizen shall support, assist and cooperate with the state intelligence work in accordance with the law.”This ban was proposed/supported/consulted by/with the Cyber Security Team of India (Ministry of Information Technology, Indian Cyber Crime Coordination Centre, Computer Emergency Response Team).People oppossing / ridiculing the ban.Intellectuals opposed Aarogya Setu app, citing &amp;quot;privacy concerns&amp;quot;Its source code is open for everyone to download, examine, redistribute, improve if they wantBut intellectuals are now opposing TikTok ban despite knowing that recently Apple caught TikTok spying on iPhone users&amp;mdash; Anshul Saxena (@AskAnshul) June 30, 2020Why now?Why invite unnecessary attention and issues? Well, no country would do that specifically against a county under normal circumstances.But in my personal opinion, apps like these which pose a threat should be banned regardless of what the situation of the country is, even if its going to attract unwanted attention.Response.This tweet was deleted later. Source: https://twitter.com/shen_shiwei/status/1277631424934240256Should we lecture him about the censorship in China? How can he make such a statement when his own country has one of the world’s most aggressive censorship systems in place, admittedly for one of the reasons as ours.SourceOh wait, forgot that even Wikipedia is blocked. If China ever decides to relieve its censorships, the aforementioned is something you might want to consider reading.&quot;, &quot;content_html&quot;: &quot;&lt;p&gt;Before starting, I would like to point that I am not a BJP supporter or any other political party for that matter. I only care about stuff that benefits the interest of India.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;tl;dr: I fully support the government’s decision of the ban on Chinese apps.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Why the ban?&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;All apps on the list are all accused of collecting unauthorized user data (like clipboard and whatnot) and this is not something new.&lt;/p&gt;&lt;p&gt;&lt;a href=\\&quot;https://www.forbes.com/sites/zakdoffman/2020/06/26/warning-apple-suddenly-catches-tiktok-secretly-spying-on-millions-of-iphone-users/#6f048e5b34ef\\&quot;&gt;Source 1&lt;/a&gt;• &lt;a href=\\&quot;https://www.businesstoday.in/technology/news/tiktok-secretly-accesses-users-data-apple-catches-it-red-handed/story/408359.html\\&quot;&gt;Source 2&lt;/a&gt;&lt;/p&gt;&lt;p&gt;What we don’t know for a fact is whether they are doing this for the interest of a 3rd party, be it any government or corporation but what we do know is that if the government wanted to access this data; by law, they can. Failing to comply with the government puts these companies in trouble because of espionage and national security laws in the country.&lt;/p&gt;&lt;p&gt;&lt;em&gt;“The 2017 National Intelligence Law and the 2014 Counter-Espionage Law. Article 7 of the first law states that “any organization or citizen shall support, assist and cooperate with the state intelligence work in accordance with the law.”&lt;/em&gt;&lt;/p&gt;&lt;p&gt;This ban was proposed/supported/consulted by/with the Cyber Security Team of India (Ministry of Information Technology, Indian Cyber Crime Coordination Centre, Computer Emergency Response Team).&lt;/p&gt;&lt;p&gt;&lt;strong&gt;People oppossing / ridiculing the ban.&lt;/strong&gt;&lt;/p&gt;&lt;blockquote class=\\&quot;twitter-tweet\\&quot;&gt;&lt;p lang=\\&quot;en\\&quot; dir=\\&quot;ltr\\&quot;&gt;Intellectuals opposed Aarogya Setu app, citing &amp;quot;privacy concerns&amp;quot;&lt;br /&gt;&lt;br /&gt;Its source code is open for everyone to download, examine, redistribute, improve if they want&lt;br /&gt;&lt;br /&gt;But intellectuals are now opposing TikTok ban despite knowing that recently Apple caught TikTok spying on iPhone users&lt;/p&gt;&amp;mdash; Anshul Saxena (@AskAnshul) &lt;a href=\\&quot;https://twitter.com/AskAnshul/status/1277871856666636288?ref_src=twsrc%5Etfw\\&quot;&gt;June 30, 2020&lt;/a&gt;&lt;/blockquote&gt;&lt;script async=\\&quot;\\&quot; src=\\&quot;https://platform.twitter.com/widgets.js\\&quot; charset=\\&quot;utf-8\\&quot;&gt;&lt;/script&gt;&lt;p&gt;&lt;strong&gt;Why now?&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;Why invite unnecessary attention and issues? Well, no country would do that specifically against a county under normal circumstances.&lt;/p&gt;&lt;p&gt;But in my personal opinion, apps like these which pose a threat should be banned regardless of what the situation of the country is, even if its going to attract unwanted attention.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;Response.&lt;/strong&gt;&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;/uploads/186abd5b5784ccce53367bc3ae165c60-1.png\\&quot; alt=\\&quot;\\&quot; /&gt;&lt;/p&gt;&lt;p&gt;This tweet was deleted later. Source: &lt;a href=\\&quot;https://twitter.com/shen_shiwei/status/1277631424934240256\\&quot; title=\\&quot;https://twitter.com/shen_shiwei/status/1277631424934240256\\&quot;&gt;https://twitter.com/shen_shiwei/status/1277631424934240256&lt;/a&gt;&lt;/p&gt;&lt;p&gt;Should we lecture him about the censorship in China? How can he make such a statement when his own country has one of the world’s most aggressive censorship systems in place, admittedly for one of the reasons as ours.&lt;/p&gt;&lt;p&gt;&lt;a href=\\&quot;https://en.wikipedia.org/wiki/List_of_websites_blocked_in_mainland_China\\&quot;&gt;Source&lt;/a&gt;&lt;/p&gt;&lt;p&gt;Oh wait, forgot that even Wikipedia is blocked. If China ever decides to relieve its censorships, the aforementioned is something you might want to consider reading.&lt;/p&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/07/28/ban-on-tiktok-and-the-other-chinese-apps&quot;, &quot;date_published&quot;: &quot;2020-07-28T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-07-28T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2020/07/14/pocket-money&quot;, &quot;title&quot;: &quot;Pocket money&quot;, &quot;summary&quot;: &quot;&quot;, &quot;content_text&quot;: &quot;This first thing that comes to my mind when I think about pocket money is Vishu which is a festival we celebrate in Kerala. On this day, there is a tradition of giving young people money. Although Vishu marks the first day of Medam, the ninth month in the Malayalam calendar (yes, I googled this), I believe this day also signifies the rotation of wealth.Writing this stuff brings back so many memories. The day starts by our mom (we are 2 siblings) waking us up early in the morning and telling us to keep our eyes closed as she takes us to show us the statue of a Hindu deity decorated with flowers and other beautiful articles. Then she hands each of us a rupee note (of 100/500 denomination). That’s how the day starts!We were a tightly packed society meaning all my friends were in the same neighborhood. So after receiving these “vishumoney” (this is what we used to call it) from our dad and grandparents we would run off to our friends’ house.P.S (but not really) grandparents used to give us the largest amount.You can think of it like Halloween but instead of candies, its money and exclusive to Kerala. At the end of the day, me and and brother would add our “collections” and make a list on what to spend it on. If we were unable to spend it on anything, we would just return it to our parents i.e after Vishu of course!I didn’t require any “pocket money” in my childhood as everything was available and provided at home only.In the old days, elder people used to only give coins to younger folk but you know these days, because of inflation and all… (͡ ° ͜ʖ ͡ °)&quot;, &quot;content_html&quot;: &quot;&lt;p&gt;This first thing that comes to my mind when I think about pocket money is Vishu which is a festival we celebrate in Kerala. On this day, there is a tradition of giving young people money. Although Vishu marks the first day of Medam, the ninth month in the Malayalam calendar (yes, I googled this), I believe this day also signifies the rotation of wealth.&lt;/p&gt;&lt;p&gt;Writing this stuff brings back so many memories. The day starts by our mom (we are 2 siblings) waking us up early in the morning and telling us to keep our eyes closed as she takes us to show us the statue of a Hindu deity decorated with flowers and other beautiful articles. Then she hands each of us a rupee note (of 100/500 denomination). That’s how the day starts!&lt;/p&gt;&lt;p&gt;We were a tightly packed society meaning all my friends were in the same neighborhood. So after receiving these “vishumoney” (this is what we used to call it) from our dad and grandparents we would run off to our friends’ house.&lt;/p&gt;&lt;p&gt;P.S (but not really) grandparents used to give us the largest amount.&lt;/p&gt;&lt;p&gt;You can think of it like Halloween but instead of candies, its money and exclusive to Kerala. At the end of the day, me and and brother would add our “collections” and make a list on what to spend it on. If we were unable to spend it on anything, we would just return it to our parents i.e after Vishu of course!&lt;/p&gt;&lt;p&gt;I didn’t require any “pocket money” in my childhood as everything was available and provided at home only.&lt;/p&gt;&lt;p&gt;In the old days, elder people used to only give coins to younger folk but you know these days, because of inflation and all… (͡ ° ͜ʖ ͡ °)&lt;/p&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/07/14/pocket-money&quot;, &quot;date_published&quot;: &quot;2020-07-14T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-07-14T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2020/06/11/show-latest-commit-svelte&quot;, &quot;title&quot;: &quot;Show latest commit on Svelte&quot;, &quot;summary&quot;: null, &quot;content_text&quot;: &quot;Scroll down for full codeOutputcommit 72ea82sImport onMount from Svelteimport { onMount } from &#39;svelte&#39;onMount runs immediately after the component is rendered to the DOM.Write a simple fetch function to fetch from the Github APISo here we are telling Svelte to fetch some data from this API when the component is first rendered. Note that the functions inside the onMount is only triggered when it enters the DOM.onMount(async () =&amp;gt; { await fetch(&#39;https://api.github.com/repos/${userName}/${repoName}/commits&#39;) .then((response) =&amp;gt; response.json()) .then((data) =&amp;gt; { id = data[0].sha.slice(0, 7) })})await fetch(&#39;https://api.github.com/repos/${userName}/${repoName}/commits&#39;)Performs a fetch request to the Github API’s. Replace this userName and repoName with yours..then((response) =&amp;gt; response.json())Converts the response to .json objects..then((data) =&amp;gt; {id = data[0].sha.slice(0, 7)})Assigning only the first index data[0] sha key (where our commit id is) to a variable id since our request returned an array of objects with all the commits and info.slice(0,7)Takes only the first 7 digits since it is the Git default for a short SHAFull Code&quot;, &quot;content_html&quot;: &quot;&lt;h4 id=\\&quot;scroll-down-for-full-code\\&quot;&gt;&lt;a href=\\&quot;#full-code\\&quot;&gt;Scroll down for full code&lt;/a&gt;&lt;/h4&gt;&lt;h4 id=\\&quot;output\\&quot;&gt;Output&lt;/h4&gt;&lt;div class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;&lt;div class=\\&quot;highlight\\&quot;&gt;&lt;pre class=\\&quot;highlight\\&quot;&gt;&lt;code&gt;commit 72ea82s&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\\&quot;import-onmount-from-svelte\\&quot;&gt;Import onMount from Svelte&lt;/h4&gt;&lt;p&gt;&lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;import { onMount } from &#39;svelte&#39;&lt;/code&gt;&lt;/p&gt;&lt;p&gt;&lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;onMount&lt;/code&gt; runs immediately after the component is rendered to the DOM.&lt;/p&gt;&lt;h4 id=\\&quot;write-a-simple-fetch-function-to-fetch-from-the-github-api\\&quot;&gt;Write a simple fetch function to fetch from the Github API&lt;/h4&gt;&lt;p&gt;So here we are telling Svelte to fetch some data from this API when the component is first rendered. Note that the functions inside the &lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;onMount&lt;/code&gt; is only triggered when it enters the DOM.&lt;/p&gt;&lt;div class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;&lt;div class=\\&quot;highlight\\&quot;&gt;&lt;pre class=\\&quot;highlight\\&quot;&gt;&lt;code&gt;onMount(async () =&amp;gt; { await fetch(&#39;https://api.github.com/repos/${userName}/${repoName}/commits&#39;) .then((response) =&amp;gt; response.json()) .then((data) =&amp;gt; { id = data[0].sha.slice(0, 7) })})&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;&lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;await fetch(&#39;https://api.github.com/repos/${userName}/${repoName}/commits&#39;)&lt;/code&gt;Performs a fetch request to the Github API’s. Replace this &lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;userName&lt;/code&gt; and &lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;repoName&lt;/code&gt; with yours.&lt;/p&gt;&lt;p&gt;&lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;.then((response) =&amp;gt; response.json())&lt;/code&gt;&lt;br /&gt;Converts the response to &lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;.json&lt;/code&gt; objects.&lt;/p&gt;&lt;p&gt;&lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;.then((data) =&amp;gt; {id = data[0].sha.slice(0, 7)})&lt;/code&gt;&lt;br /&gt;Assigning only the first index &lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;data[0]&lt;/code&gt; &lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;sha&lt;/code&gt; key (where our commit id is) to a variable &lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;id&lt;/code&gt; since our request returned an array of objects with all the commits and info.&lt;/p&gt;&lt;p&gt;&lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;slice(0,7)&lt;/code&gt;&lt;br /&gt;Takes only the first 7 digits since it is the Git default for a short SHA&lt;/p&gt;&lt;h4 id=\\&quot;full-code\\&quot;&gt;&lt;a name=\\&quot;full-code\\&quot;&gt;Full Code&lt;/a&gt;&lt;/h4&gt;&lt;script src=\\&quot;https://gist.github.com/rohanharikr/aef6d401adc26f403efe98d6238602d4.js\\&quot;&gt;&lt;/script&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/06/11/show-latest-commit-svelte&quot;, &quot;date_published&quot;: &quot;2020-06-11T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-06-11T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2020/06/02/rock-paper-scissors-javascript&quot;, &quot;title&quot;: &quot;Rock, paper, scissors, javascript&quot;, &quot;summary&quot;: null, &quot;content_text&quot;: &quot;Scroll down for full codeOutput// Pass a choice as an argument to the main function.You chose paper and computer chose rock.You win!Create an array of all possible choicesconst choices = [\\&quot;rock\\&quot;, \\&quot;paper\\&quot;, \\&quot;scissors\\&quot;]Random ChoiceThis would give us a random number between 1 and the array length which in this case happens to be 3.Math.floor(Math.random() * choices.length)Main functionThe Random Choice code is put inside a function because ideally, every time this function is called, a new choice would be generated.function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`)...}MatchmakingFirst things first, let’s consider all the tie cases.function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`) \\tif (userChoice === computerChoice) { console.log(\\&quot;It&#39;s a tie!\\&quot;) }...}All the cases when your choice is rockif (userChoice === \\&quot;rock\\&quot;) {\\tif (computerChoice === \\&quot;paper\\&quot;) { console.log(\\&quot;You lost!\\&quot;) } else if (computerChoice === \\&quot;scissors\\&quot;) { console.log(\\&quot;You won!\\&quot;) }Repeat for other n choices; this case, twoif (userChoice === \\&quot;paper\\&quot;) { if (computerChoice === \\&quot;rock\\&quot;) { console.log(\\&quot;You won!\\&quot;) } else if (computerChoice === \\&quot;scissors\\&quot;) { console.log(\\&quot;You lost!\\&quot;) }}if (userChoice === \\&quot;scissors\\&quot;) { if (computerChoice === \\&quot;rock\\&quot;) { console.log(\\&quot;You lost!\\&quot;) } else if (computerChoice === \\&quot;paper\\&quot;) { console.log(\\&quot;You won!\\&quot;) }}Optimise by writing all the cases in one blockif (userChoice === computerChoice) { console.log(\\&quot;It&#39;s a tie!\\&quot;) } else if (userChoice === \\&quot;rock\\&quot;) { if (computerChoice === \\&quot;paper\\&quot;) { console.log(\\&quot;You lost!\\&quot;) } else if (computerChoice === \\&quot;scissors\\&quot;) { console.log(\\&quot;You won!\\&quot;) } } else if (userChoice === \\&quot;paper\\&quot;) { if (computerChoice === \\&quot;rock\\&quot;) { console.log(\\&quot;You won!\\&quot;) } else if (computerChoice === \\&quot;scissors\\&quot;) { console.log(\\&quot;You lost!\\&quot;) } } else if (userChoice === \\&quot;scissors\\&quot;) { if (computerChoice === \\&quot;rock\\&quot;) { console.log(\\&quot;You lost!\\&quot;) } else if (computerChoice === \\&quot;paper\\&quot;) { console.log(\\&quot;You won!\\&quot;) } }Full Code&quot;, &quot;content_html&quot;: &quot;&lt;h4 id=\\&quot;scroll-down-for-full-code\\&quot;&gt;&lt;a href=\\&quot;#full-code\\&quot;&gt;Scroll down for full code&lt;/a&gt;&lt;/h4&gt;&lt;h4 id=\\&quot;output\\&quot;&gt;Output&lt;/h4&gt;&lt;div class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;&lt;div class=\\&quot;highlight\\&quot;&gt;&lt;pre class=\\&quot;highlight\\&quot;&gt;&lt;code&gt;// Pass a choice as an argument to the main function.You chose paper and computer chose rock.You win!&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\\&quot;create-an-array-of-all-possible-choices\\&quot;&gt;Create an array of all possible choices&lt;/h4&gt;&lt;p&gt;&lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;const choices = [\\&quot;rock\\&quot;, \\&quot;paper\\&quot;, \\&quot;scissors\\&quot;]&lt;/code&gt;&lt;/p&gt;&lt;h4 id=\\&quot;random-choice\\&quot;&gt;Random Choice&lt;/h4&gt;&lt;p&gt;This would give us a random number between 1 and the array length which in this case happens to be 3.&lt;/p&gt;&lt;p&gt;&lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;Math.floor(Math.random() * choices.length)&lt;/code&gt;&lt;/p&gt;&lt;h4 id=\\&quot;main-function\\&quot;&gt;Main function&lt;/h4&gt;&lt;p&gt;The &lt;code class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;Random Choice&lt;/code&gt; code is put inside a function because ideally, every time this function is called, a new choice would be generated.&lt;/p&gt;&lt;div class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;&lt;div class=\\&quot;highlight\\&quot;&gt;&lt;pre class=\\&quot;highlight\\&quot;&gt;&lt;code&gt;function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`)...}&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\\&quot;matchmaking\\&quot;&gt;Matchmaking&lt;/h4&gt;&lt;p&gt;First things first, let’s consider all the tie cases.&lt;/p&gt;&lt;div class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;&lt;div class=\\&quot;highlight\\&quot;&gt;&lt;pre class=\\&quot;highlight\\&quot;&gt;&lt;code&gt;function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`) \\tif (userChoice === computerChoice) { console.log(\\&quot;It&#39;s a tie!\\&quot;) }...}&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\\&quot;all-the-cases-when-your-choice-is-rock\\&quot;&gt;All the cases when your choice is rock&lt;/h4&gt;&lt;div class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;&lt;div class=\\&quot;highlight\\&quot;&gt;&lt;pre class=\\&quot;highlight\\&quot;&gt;&lt;code&gt;if (userChoice === \\&quot;rock\\&quot;) {\\tif (computerChoice === \\&quot;paper\\&quot;) { console.log(\\&quot;You lost!\\&quot;) } else if (computerChoice === \\&quot;scissors\\&quot;) { console.log(\\&quot;You won!\\&quot;) }&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\\&quot;repeat-for-other-n-choices-this-case-two\\&quot;&gt;Repeat for other n choices; this case, two&lt;/h4&gt;&lt;div class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;&lt;div class=\\&quot;highlight\\&quot;&gt;&lt;pre class=\\&quot;highlight\\&quot;&gt;&lt;code&gt;if (userChoice === \\&quot;paper\\&quot;) { if (computerChoice === \\&quot;rock\\&quot;) { console.log(\\&quot;You won!\\&quot;) } else if (computerChoice === \\&quot;scissors\\&quot;) { console.log(\\&quot;You lost!\\&quot;) }}if (userChoice === \\&quot;scissors\\&quot;) { if (computerChoice === \\&quot;rock\\&quot;) { console.log(\\&quot;You lost!\\&quot;) } else if (computerChoice === \\&quot;paper\\&quot;) { console.log(\\&quot;You won!\\&quot;) }}&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\\&quot;optimise-by-writing-all-the-cases-in-one-block\\&quot;&gt;Optimise by writing all the cases in one block&lt;/h4&gt;&lt;div class=\\&quot;language-plaintext highlighter-rouge\\&quot;&gt;&lt;div class=\\&quot;highlight\\&quot;&gt;&lt;pre class=\\&quot;highlight\\&quot;&gt;&lt;code&gt;if (userChoice === computerChoice) { console.log(\\&quot;It&#39;s a tie!\\&quot;) } else if (userChoice === \\&quot;rock\\&quot;) { if (computerChoice === \\&quot;paper\\&quot;) { console.log(\\&quot;You lost!\\&quot;) } else if (computerChoice === \\&quot;scissors\\&quot;) { console.log(\\&quot;You won!\\&quot;) } } else if (userChoice === \\&quot;paper\\&quot;) { if (computerChoice === \\&quot;rock\\&quot;) { console.log(\\&quot;You won!\\&quot;) } else if (computerChoice === \\&quot;scissors\\&quot;) { console.log(\\&quot;You lost!\\&quot;) } } else if (userChoice === \\&quot;scissors\\&quot;) { if (computerChoice === \\&quot;rock\\&quot;) { console.log(\\&quot;You lost!\\&quot;) } else if (computerChoice === \\&quot;paper\\&quot;) { console.log(\\&quot;You won!\\&quot;) } }&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;h4 id=\\&quot;full-code\\&quot;&gt;&lt;a name=\\&quot;full-code\\&quot;&gt;Full Code&lt;/a&gt;&lt;/h4&gt;&lt;script src=\\&quot;https://gist.github.com/rohanharikr/8bfbd1471389e795b436cd87ab09a444.js\\&quot;&gt;&lt;/script&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2020/06/02/rock-paper-scissors-javascript&quot;, &quot;date_published&quot;: &quot;2020-06-02T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2020-06-02T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } }, { &quot;id&quot;: &quot;http://localhost:4000/2019/04/05/see-who-liked-you-without-tinder-gold&quot;, &quot;title&quot;: &quot;See who liked you without Tinder Gold&quot;, &quot;summary&quot;: &quot;What is the difference between various font formats?&quot;, &quot;content_text&quot;: &quot;ResultImages of people who liked you at 640x800, 320x400, 172x216 without Tinder Gold.SoTinder likes without Gold comes up like this, a blur effect on the photo(s). \\tInitially, I thought that the blurred images were sent from their servers itself.A simple inspection on the code-webkit-filter: blur(8px)filter: blur(8px)Okay, so they are applying a blur effect with CSS. Disabling this would give me a raw image of 172x216 dimension. Exploring media items, the recently liked (only one) would be of 320x400 dimension.https://preview.gotinder.com/18d6e533-c874-48ad-ac66-ae6b63aa77fb/172x216_c77f0e5c-40b4-4af4-9b68-5f0ff26ead90.jpgThe 172x216 in the URL is the dimensions. Changing it to 320x400, would give me an image of that dimension. All the images were coming from the same endpoint. So, I tried changing it to random dimensions with the same aspect ratio which like I guessed didn’t work because they were not storing (x dimension) in their server.Also, noticed that my profile picture was of better quality.To my surprise, that too was coming from the same endpoint. So, now I know that Tinder stores images in 640x800 also.So, that’s that.&quot;, &quot;content_html&quot;: &quot;&lt;h4 id=\\&quot;result\\&quot;&gt;Result&lt;/h4&gt;&lt;p&gt;Images of people who liked you at 640x800, 320x400, 172x216 without Tinder Gold.&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;../../../assets/images/result.png\\&quot; alt=\\&quot;\\&quot; /&gt;&lt;/p&gt;&lt;p&gt;&lt;br /&gt;&lt;/p&gt;&lt;h4 id=\\&quot;so\\&quot;&gt;So&lt;/h4&gt;&lt;p&gt;Tinder likes without Gold comes up like this, a blur effect on the photo(s).&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;../../../assets/images/tindergold.png\\&quot; alt=\\&quot;\\&quot; /&gt; \\tInitially, I thought that the blurred images were sent from their servers itself.A simple inspection on the code&lt;/p&gt;&lt;div class=\\&quot;language-html highlighter-rouge\\&quot;&gt;&lt;div class=\\&quot;highlight\\&quot;&gt;&lt;pre class=\\&quot;highlight\\&quot;&gt;&lt;code&gt;-webkit-filter: blur(8px)filter: blur(8px)&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;Okay, so they are applying a blur effect with CSS. Disabling this would give me a raw image of 172x216 dimension. Exploring media items, the recently liked (only one) would be of 320x400 dimension.&lt;/p&gt;&lt;div class=\\&quot;language-html highlighter-rouge\\&quot;&gt;&lt;div class=\\&quot;highlight\\&quot;&gt;&lt;pre class=\\&quot;highlight\\&quot;&gt;&lt;code&gt;https://preview.gotinder.com/18d6e533-c874-48ad-ac66-ae6b63aa77fb/172x216_c77f0e5c-40b4-4af4-9b68-5f0ff26ead90.jpg&lt;/code&gt;&lt;/pre&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;The 172x216 in the URL is the dimensions. Changing it to 320x400, would give me an image of that dimension. All the images were coming from the same endpoint. So, I tried changing it to random dimensions with the same aspect ratio which like I guessed didn’t work because they were not storing (x dimension) in their server.&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;../../../assets/images/error.png\\&quot; alt=\\&quot;\\&quot; /&gt;&lt;/p&gt;&lt;p&gt;Also, noticed that my profile picture was of better quality.&lt;/p&gt;&lt;p&gt;&lt;img src=\\&quot;../../../assets/images/profile.png\\&quot; alt=\\&quot;\\&quot; /&gt;&lt;/p&gt;&lt;p&gt;To my surprise, that too was coming from the same endpoint. So, now I know that Tinder stores images in 640x800 also.&lt;/p&gt;&lt;p&gt;So, that’s that.&lt;/p&gt;&quot;, &quot;url&quot;: &quot;http://localhost:4000/2019/04/05/see-who-liked-you-without-tinder-gold&quot;, &quot;date_published&quot;: &quot;2019-04-05T00:00:00+05:30&quot;, &quot;date_modified&quot;: &quot;2019-04-05T00:00:00+05:30&quot;, &quot;author&quot;: { &quot;name&quot;: &quot;rohan&quot;, &quot;url&quot;: null, &quot;avatar&quot;: null } } ] }","@type":"WebPage","headline":"rohan","url":"http://localhost:4000/feed.json","@context":"https://schema.org"}</script><title> rohan - I have too many hobbies...</title><link rel="shortcut icon" href="/favicon.png"><link rel="alternate" type="application/atom+xml" title="rohan" href="/atom.xml"><link rel="alternate" type="application/json" title="rohan" href="http://localhost:4000/feed.json" /><link rel="sitemap" type="application/xml" title="sitemap" href="/sitemap.xml" /><style> *,:after,:before{box-sizing:border-box;background-color:inherit;color:inherit;margin:0;padding:0}body{font-family:system-ui, sans-serif;-webkit-font-smoothing:antialiased;text-rendering:optimizeLegibility;line-height:1.5;font-size:1rem;color:#16171a}nav ul{border-right:1px solid #edf2f7}a{color:#000;text-decoration-skip-ink:auto;text-decoration:underline}pre{margin:.5rem 0;padding:.5rem}.post p{margin:.5rem 0}.post h1,.post h2,.post h3,.post h4{margin:1rem 0}.post h2:first-child,.project h2:first-child,.photo h2:first-child{margin-top:0}.meta{margin:2rem 0}code,pre{background:#ecedee}code{padding:.1rem}pre code{border:none}pre{padding:1rem;overflow-x:auto}img{max-width:100%}hr{background:#000;height:1px;border:0}header{flex-basis:10rem;flex-grow:1;position:relative}header a{text-decoration:none}header li{margin-bottom:.2rem;text-align:right;margin-right:2rem}header a.active{font-weight:bold}header,section{padding:1rem}blockquote{font-style:italic;border-left:5px solid #ececec;padding-left:1rem}h1,h2,h3,h4,h5{line-height:1;margin:1rem 0;font-weight:600}section h1:first-child{margin-top:0}strong,b{font-weight:bold}.photos ul{list-style:none}.photos li{margin-bottom:1.5rem}.photo picture,.project picture{margin-bottom:0.5rem}.posts ul,header ul{list-style:none}.posts li{align-items:center;display:flex;justify-content:space-between;margin-bottom:.5rem}.posts li a,.posts li div,.projects li a{white-space:nowrap;overflow:hidden;text-overflow:ellipsis;text-decoration:none}.posts li time,.projects li time{padding-left:1rem;white-space:nowrap;font-variant-numeric:tabular-nums}main{display:flex;flex-wrap:wrap;max-width:60rem;margin:2rem auto;padding:1rem}@media screen and (max-width: 45rem){header li{display:inline;margin-right:1rem}.logo{padding-bottom:1rem}header ul{border-bottom:1px solid #edf2f7;padding-bottom:2rem}nav ul{border-right:0px}.photos ul{margin-top:0.5rem}}section{flex-basis:0;flex-grow:999;min-width:70%;display:flex;flex-direction:column}figcaption{font-size:smaller}</style></head><body><main role="main"><header role="banner"> <!--<h1 class="logo">rohan</h1>--><nav role="navigation"><ul><li><a href="/" >About</a></li><li><a href="/projects" >Work</a></li><li><a href="/writing" >Writing</a></li><li><a href="/search" >Search</a></li><li><a href="/atom.xml" >Rss</a></li></ul></nav></header><section class="post"><h2></h2>{ "version": "https://jsonfeed.org/version/1", "title": "rohan", "home_page_url": "http://localhost:4000/", "feed_url": "http://localhost:4000/feed.json", "description": "I have too many hobbies...", "icon": "http://localhost:4000/apple-touch-icon.png", "favicon": "http://localhost:4000/favicon.ico", "expired": false, "author": { "name": "rohan", "url": null, "avatar": null }, "items": [ { "id": "http://localhost:4000/2020/08/14/starting-my-game-dev-journey", "title": "Starting my game development journey", "summary": null, "content_text": "Part #1 of the gamedev seriesCurrent MoodHello everyone, I have been in front of the computer playing computer games as long as I can remember. My early memories of playing videogames are on the GBA emulator exploring the epic worlds of Pokemon, Beyblade, Dragon Ball Z. I have spent countless hours playing Wild Ambition on my neighbors’ Playstation 1. After countless fights and nirahara samaram (hunger strikes), my dad finally decided to buy us a Playstation 2 but we were a little late to the party cause we got our hands on the PS2 when the PS3 was released but that was okay. PS2 was still damn popular and one of the best consoles yet with an enormous collection of games.At this point, I played games as just games without giving much thought into how it was made. It was around this time I came to know about the best game on the platform - Shadow of the Colossus from the legendary game designer, Fumito Ueda. I did not get a chance to play this on the PS2 but got a chance to play and finish the remade version for the PS4. I was broken. While playing this game, it annoyed me a lot and wondered why this game was so popular. The controls were buggy, the horse is unresponsive and lots of other issues. But in the end, the story slowly starts to come together and bam hits you in the face. The ending left me in tears. The music by Kow Otani, another legend composed a perfect soundtrack for the game. Come to think of it, Fumito intentionally decided to make the agro (the horse) less responsive because if it was like that, then it would be just robotic. He was just trying to emulate the real world. Pets don’t listen to all the time. These minor details got me started about designing games. The art, music, code, story, gameplay which goes into these is insane.I am also a big fan of Hidetaka-san and his work. The Soulsbourne series and Sekiro push the limitation of games. I find many games today not fully utilizing the medium. Videogames are the ultimate form of storytelling and very few designers have harnessed this. Just taking the world of Dark Souls as an example. The game itself offers little to no direct storytelling, meaning cutscenes and dialogues. Everything about the world is immersive. Everything is up to the player, from figuring out the story and what’s happening by observing the world and the mechanics. Games like Ico, SotC, The Last Guardian, etc are benchmarks and push how we tell stories through games.Another inspiration for me is ConcernedApe aka Eric Barone, Chris Sawyer for what they have achieved, technically and artistically. Just to process the fact that Stardew Valley was written entirely by one person is just amazing.Cool, so all these inspired me to make games. But it’s hard for me to even believe that a song inspired me to make the game that I am going to make. Its an album by Sigur Ros called Route One. It is instrumental and plays for 24hrs. There is something very mysterious, eerie about this album that got me to thinking how it would look like on screen. That’s the beauty of art. One medium can inspire another. But then again, everything is art.Buckethead is also a great inspiration. I love mysteries and decoding stuff without someone spoon-feeding me. Not only does this give the player more freedom, but also gives him/her a sense of achievement and satisfaction. Music by Buckethead teaches my to enjoy the little things in life. I started to see the world differently. It’s beauitful how songs with no voals can still have influence.Coming back to the first line, I have been playing games for so long and now, I have decided to finally make mine. I want to do everything by myself from writing the code, creating art and music. I have little knowledge of all the aspects of game design so this would also be a good way to improve.To design a game, you have to be open-minded. I consider myself to be an asshole but every day I am trying to be better. I am. I have been so arrogant and ignorant and every time I think about something bad (that I would never do now), I just want to drop dead. I always hated music other than the traditional stuff, fo example EDM and stuff. I have been such an ignoramus and feel sad and pity for my pas self. I am getting into these things which I would have never done in the past because of my arrogancy. Games like SDV have got me thinking about synth music and its beauty. Everything is beautiful. Everything is different and what makes us different make us beautiful. Many of my friends (I don’t even know how or why they want to be friends with someone like me but I am glad that I am) ask me why I always disappear and I always give some lame reply. But the real reason, I want to get away from my past self and whatever I did. It’s hard to face whatever I did. I want to start fresh. I want to be a ghost.I am not a great artist, heck not even an average one. I am choosing pixel art because the entry-level to that is low compared to high-quality 2d or 3d. I have played guitar for more than 7 years but I am ashamed to say that I don’t know anything about it. I just play. Some people have the natural ability to understand and do. Understand why some things are the way they are.I am afraid that I won’t be able to complete this project. This is a very ambitious one. I am just working on an idea. I have a vision on how the game should play, feel, and look like but do not know how to get there. There is no roadmap, no goals; just progressing step by step. Building as I go in the hope that it will culminate to what my vision is.I am lazier than 99% of the people. I lose motivation very quickly. My attention span is scarily low. For the past couple of months, I have even lost the motivation to wake up. For someone with these traits, it’s hard to create a game. Creating a game is insanely difficult. So, this would be a challenge for me. I quit easily. I do not want to. I am going to set a target and will achieve it even if at any point, I feel like what I am making is terrible and not even worth the time. I need to push myself.I am starting this series to inspire me to keep making the game regardless of people are reading it or not. The more I invest in something, the more it is harder to get out and that is exactly what I am intending to do. I want to put my life into this that it should feel like the game depends on it. I am not looking for any commercial success or fame. I am not doing this to prove anything.I am doing this for myself. To tell myself 20 years from now that I have made something, achieved something in life. Something worthy to even mention because I honestly don’t have anything right now.“We have two lives, and the second begins when we realize we only have one.”― ConfuciusMy only dream and goal before I die is to be genuinely proud of something I create and if brings happiness to others too, I will be thrilled. I also want to make my parents proud who have been supporting me regardless of my ups and downs. I also want it to do it for them.I will be documenting my work once in a while. I have set up the environment. As of now, using Lua and the love2d framework because I found the fairly straightforward. Tried multiple game engines, frameworks but love2d with Lua scored the goal for me. The gameplay style I am going for would be closer to Miyazaki-sans works.", "content_html": "<h4 id=\"part-1-of-the-gamedev-series\">Part #1 of the gamedev series</h4><p>Current Mood</p><iframe src=\"https://open.spotify.com/embed/track/5GpamlUn0qYsT359B2ogDf\" width=\"100%\" height=\"80\" frameborder=\"0\" allowtransparency=\"true\" allow=\"encrypted-media\"></iframe><p><br /></p><p>Hello everyone, I have been in front of the computer playing computer games as long as I can remember. My early memories of playing videogames are on the GBA emulator exploring the epic worlds of Pokemon, Beyblade, Dragon Ball Z. I have spent countless hours playing Wild Ambition on my neighbors’ Playstation 1. After countless fights and nirahara samaram (hunger strikes), my dad finally decided to buy us a Playstation 2 but we were a little late to the party cause we got our hands on the PS2 when the PS3 was released but that was okay. PS2 was still damn popular and one of the best consoles yet with an enormous collection of games.</p><p>At this point, I played games as just games without giving much thought into how it was made. It was around this time I came to know about the best game on the platform - Shadow of the Colossus from the legendary game designer, Fumito Ueda. I did not get a chance to play this on the PS2 but got a chance to play and finish the remade version for the PS4. I was broken. While playing this game, it annoyed me a lot and wondered why this game was so popular. The controls were buggy, the horse is unresponsive and lots of other issues. But in the end, the story slowly starts to come together and bam hits you in the face. The ending left me in tears. The music by Kow Otani, another legend composed a perfect soundtrack for the game. Come to think of it, Fumito intentionally decided to make the agro (the horse) less responsive because if it was like that, then it would be just robotic. He was just trying to emulate the real world. Pets don’t listen to all the time. These minor details got me started about designing games. The art, music, code, story, gameplay which goes into these is insane.</p><p>I am also a big fan of Hidetaka-san and his work. The Soulsbourne series and Sekiro push the limitation of games. I find many games today not fully utilizing the medium. Videogames are the ultimate form of storytelling and very few designers have harnessed this. Just taking the world of Dark Souls as an example. The game itself offers little to no direct storytelling, meaning cutscenes and dialogues. Everything about the world is immersive. Everything is up to the player, from figuring out the story and what’s happening by observing the world and the mechanics. Games like Ico, SotC, The Last Guardian, etc are benchmarks and push how we tell stories through games.</p><p>Another inspiration for me is ConcernedApe aka Eric Barone, Chris Sawyer for what they have achieved, technically and artistically. Just to process the fact that Stardew Valley was written entirely by one person is just amazing.</p><p>Cool, so all these inspired me to make games. But it’s hard for me to even believe that a song inspired me to make the game that I am going to make. Its an album by Sigur Ros called Route One. It is instrumental and plays for 24hrs. There is something very mysterious, eerie about this album that got me to thinking how it would look like on screen. That’s the beauty of art. One medium can inspire another. But then again, everything is art.</p><p>Buckethead is also a great inspiration. I love mysteries and decoding stuff without someone spoon-feeding me. Not only does this give the player more freedom, but also gives him/her a sense of achievement and satisfaction. Music by Buckethead teaches my to enjoy the little things in life. I started to see the world differently. It’s beauitful how songs with no voals can still have influence.</p><p>Coming back to the first line, I have been playing games for so long and now, I have decided to finally make mine. I want to do everything by myself from writing the code, creating art and music. I have little knowledge of all the aspects of game design so this would also be a good way to improve.</p><p>To design a game, you have to be open-minded. I consider myself to be an asshole but every day I am trying to be better. I am. I have been so arrogant and ignorant and every time I think about something bad (that I would never do now), I just want to drop dead. I always hated music other than the traditional stuff, fo example EDM and stuff. I have been such an ignoramus and feel sad and pity for my pas self. I am getting into these things which I would have never done in the past because of my arrogancy. Games like SDV have got me thinking about synth music and its beauty. Everything is beautiful. Everything is different and what makes us different make us beautiful. Many of my friends (I don’t even know how or why they want to be friends with someone like me but I am glad that I am) ask me why I always disappear and I always give some lame reply. But the real reason, I want to get away from my past self and whatever I did. It’s hard to face whatever I did. I want to start fresh. I want to be a ghost.</p><p>I am not a great artist, heck not even an average one. I am choosing pixel art because the entry-level to that is low compared to high-quality 2d or 3d. I have played guitar for more than 7 years but I am ashamed to say that I don’t know anything about it. I just play. Some people have the natural ability to understand and do. Understand why some things are the way they are.</p><p>I am afraid that I won’t be able to complete this project. This is a very ambitious one. I am just working on an idea. I have a vision on how the game should play, feel, and look like but do not know how to get there. There is no roadmap, no goals; just progressing step by step. Building as I go in the hope that it will culminate to what my vision is.</p><p>I am lazier than 99% of the people. I lose motivation very quickly. My attention span is scarily low. For the past couple of months, I have even lost the motivation to wake up. For someone with these traits, it’s hard to create a game. Creating a game is insanely difficult. So, this would be a challenge for me. I quit easily. I do not want to. I am going to set a target and will achieve it even if at any point, I feel like what I am making is terrible and not even worth the time. I need to push myself.</p><p>I am starting this series to inspire me to keep making the game regardless of people are reading it or not. The more I invest in something, the more it is harder to get out and that is exactly what I am intending to do. I want to put my life into this that it should feel like the game depends on it. I am not looking for any commercial success or fame. I am not doing this to prove anything.</p><p>I am doing this for myself. To tell myself 20 years from now that I have made something, achieved something in life. Something worthy to even mention because I honestly don’t have anything right now.</p><p>“We have two lives, and the second begins when we realize we only have one.”</p><p>― Confucius</p><p>My only dream and goal before I die is to be genuinely proud of something I create and if brings happiness to others too, I will be thrilled. I also want to make my parents proud who have been supporting me regardless of my ups and downs. I also want it to do it for them.</p><p>I will be documenting my work once in a while. I have set up the environment. As of now, using Lua and the love2d framework because I found the fairly straightforward. Tried multiple game engines, frameworks but love2d with Lua scored the goal for me. The gameplay style I am going for would be closer to Miyazaki-sans works.</p>", "url": "http://localhost:4000/2020/08/14/starting-my-game-dev-journey", "date_published": "2020-08-14T00:00:00+05:30", "date_modified": "2020-08-14T00:00:00+05:30", "author": { "name": "rohan", "url": null, "avatar": null } }, { "id": "http://localhost:4000/2020/07/28/ban-on-tiktok-and-the-other-chinese-apps", "title": "Ban on TikTok and the other Chinese apps", "summary": "", "content_text": "Before starting, I would like to point that I am not a BJP supporter or any other political party for that matter. I only care about stuff that benefits the interest of India.tl;dr: I fully support the government’s decision of the ban on Chinese apps.Why the ban?All apps on the list are all accused of collecting unauthorized user data (like clipboard and whatnot) and this is not something new.Source 1• Source 2What we don’t know for a fact is whether they are doing this for the interest of a 3rd party, be it any government or corporation but what we do know is that if the government wanted to access this data; by law, they can. Failing to comply with the government puts these companies in trouble because of espionage and national security laws in the country.“The 2017 National Intelligence Law and the 2014 Counter-Espionage Law. Article 7 of the first law states that “any organization or citizen shall support, assist and cooperate with the state intelligence work in accordance with the law.”This ban was proposed/supported/consulted by/with the Cyber Security Team of India (Ministry of Information Technology, Indian Cyber Crime Coordination Centre, Computer Emergency Response Team).People oppossing / ridiculing the ban.Intellectuals opposed Aarogya Setu app, citing &quot;privacy concerns&quot;Its source code is open for everyone to download, examine, redistribute, improve if they wantBut intellectuals are now opposing TikTok ban despite knowing that recently Apple caught TikTok spying on iPhone users&mdash; Anshul Saxena (@AskAnshul) June 30, 2020Why now?Why invite unnecessary attention and issues? Well, no country would do that specifically against a county under normal circumstances.But in my personal opinion, apps like these which pose a threat should be banned regardless of what the situation of the country is, even if its going to attract unwanted attention.Response.This tweet was deleted later. Source: https://twitter.com/shen_shiwei/status/1277631424934240256Should we lecture him about the censorship in China? How can he make such a statement when his own country has one of the world’s most aggressive censorship systems in place, admittedly for one of the reasons as ours.SourceOh wait, forgot that even Wikipedia is blocked. If China ever decides to relieve its censorships, the aforementioned is something you might want to consider reading.", "content_html": "<p>Before starting, I would like to point that I am not a BJP supporter or any other political party for that matter. I only care about stuff that benefits the interest of India.</p><p><strong>tl;dr: I fully support the government’s decision of the ban on Chinese apps.</strong></p><p><strong>Why the ban?</strong></p><p>All apps on the list are all accused of collecting unauthorized user data (like clipboard and whatnot) and this is not something new.</p><p><a href=\"https://www.forbes.com/sites/zakdoffman/2020/06/26/warning-apple-suddenly-catches-tiktok-secretly-spying-on-millions-of-iphone-users/#6f048e5b34ef\">Source 1</a>• <a href=\"https://www.businesstoday.in/technology/news/tiktok-secretly-accesses-users-data-apple-catches-it-red-handed/story/408359.html\">Source 2</a></p><p>What we don’t know for a fact is whether they are doing this for the interest of a 3rd party, be it any government or corporation but what we do know is that if the government wanted to access this data; by law, they can. Failing to comply with the government puts these companies in trouble because of espionage and national security laws in the country.</p><p><em>“The 2017 National Intelligence Law and the 2014 Counter-Espionage Law. Article 7 of the first law states that “any organization or citizen shall support, assist and cooperate with the state intelligence work in accordance with the law.”</em></p><p>This ban was proposed/supported/consulted by/with the Cyber Security Team of India (Ministry of Information Technology, Indian Cyber Crime Coordination Centre, Computer Emergency Response Team).</p><p><strong>People oppossing / ridiculing the ban.</strong></p><blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Intellectuals opposed Aarogya Setu app, citing &quot;privacy concerns&quot;<br /><br />Its source code is open for everyone to download, examine, redistribute, improve if they want<br /><br />But intellectuals are now opposing TikTok ban despite knowing that recently Apple caught TikTok spying on iPhone users</p>&mdash; Anshul Saxena (@AskAnshul) <a href=\"https://twitter.com/AskAnshul/status/1277871856666636288?ref_src=twsrc%5Etfw\">June 30, 2020</a></blockquote><script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script><p><strong>Why now?</strong></p><p>Why invite unnecessary attention and issues? Well, no country would do that specifically against a county under normal circumstances.</p><p>But in my personal opinion, apps like these which pose a threat should be banned regardless of what the situation of the country is, even if its going to attract unwanted attention.</p><p><strong>Response.</strong></p><p><img src=\"/uploads/186abd5b5784ccce53367bc3ae165c60-1.png\" alt=\"\" /></p><p>This tweet was deleted later. Source: <a href=\"https://twitter.com/shen_shiwei/status/1277631424934240256\" title=\"https://twitter.com/shen_shiwei/status/1277631424934240256\">https://twitter.com/shen_shiwei/status/1277631424934240256</a></p><p>Should we lecture him about the censorship in China? How can he make such a statement when his own country has one of the world’s most aggressive censorship systems in place, admittedly for one of the reasons as ours.</p><p><a href=\"https://en.wikipedia.org/wiki/List_of_websites_blocked_in_mainland_China\">Source</a></p><p>Oh wait, forgot that even Wikipedia is blocked. If China ever decides to relieve its censorships, the aforementioned is something you might want to consider reading.</p>", "url": "http://localhost:4000/2020/07/28/ban-on-tiktok-and-the-other-chinese-apps", "date_published": "2020-07-28T00:00:00+05:30", "date_modified": "2020-07-28T00:00:00+05:30", "author": { "name": "rohan", "url": null, "avatar": null } }, { "id": "http://localhost:4000/2020/07/14/pocket-money", "title": "Pocket money", "summary": "", "content_text": "This first thing that comes to my mind when I think about pocket money is Vishu which is a festival we celebrate in Kerala. On this day, there is a tradition of giving young people money. Although Vishu marks the first day of Medam, the ninth month in the Malayalam calendar (yes, I googled this), I believe this day also signifies the rotation of wealth.Writing this stuff brings back so many memories. The day starts by our mom (we are 2 siblings) waking us up early in the morning and telling us to keep our eyes closed as she takes us to show us the statue of a Hindu deity decorated with flowers and other beautiful articles. Then she hands each of us a rupee note (of 100/500 denomination). That’s how the day starts!We were a tightly packed society meaning all my friends were in the same neighborhood. So after receiving these “vishumoney” (this is what we used to call it) from our dad and grandparents we would run off to our friends’ house.P.S (but not really) grandparents used to give us the largest amount.You can think of it like Halloween but instead of candies, its money and exclusive to Kerala. At the end of the day, me and and brother would add our “collections” and make a list on what to spend it on. If we were unable to spend it on anything, we would just return it to our parents i.e after Vishu of course!I didn’t require any “pocket money” in my childhood as everything was available and provided at home only.In the old days, elder people used to only give coins to younger folk but you know these days, because of inflation and all… (͡ ° ͜ʖ ͡ °)", "content_html": "<p>This first thing that comes to my mind when I think about pocket money is Vishu which is a festival we celebrate in Kerala. On this day, there is a tradition of giving young people money. Although Vishu marks the first day of Medam, the ninth month in the Malayalam calendar (yes, I googled this), I believe this day also signifies the rotation of wealth.</p><p>Writing this stuff brings back so many memories. The day starts by our mom (we are 2 siblings) waking us up early in the morning and telling us to keep our eyes closed as she takes us to show us the statue of a Hindu deity decorated with flowers and other beautiful articles. Then she hands each of us a rupee note (of 100/500 denomination). That’s how the day starts!</p><p>We were a tightly packed society meaning all my friends were in the same neighborhood. So after receiving these “vishumoney” (this is what we used to call it) from our dad and grandparents we would run off to our friends’ house.</p><p>P.S (but not really) grandparents used to give us the largest amount.</p><p>You can think of it like Halloween but instead of candies, its money and exclusive to Kerala. At the end of the day, me and and brother would add our “collections” and make a list on what to spend it on. If we were unable to spend it on anything, we would just return it to our parents i.e after Vishu of course!</p><p>I didn’t require any “pocket money” in my childhood as everything was available and provided at home only.</p><p>In the old days, elder people used to only give coins to younger folk but you know these days, because of inflation and all… (͡ ° ͜ʖ ͡ °)</p>", "url": "http://localhost:4000/2020/07/14/pocket-money", "date_published": "2020-07-14T00:00:00+05:30", "date_modified": "2020-07-14T00:00:00+05:30", "author": { "name": "rohan", "url": null, "avatar": null } }, { "id": "http://localhost:4000/2020/06/11/show-latest-commit-svelte", "title": "Show latest commit on Svelte", "summary": null, "content_text": "Scroll down for full codeOutputcommit 72ea82sImport onMount from Svelteimport { onMount } from 'svelte'onMount runs immediately after the component is rendered to the DOM.Write a simple fetch function to fetch from the Github APISo here we are telling Svelte to fetch some data from this API when the component is first rendered. Note that the functions inside the onMount is only triggered when it enters the DOM.onMount(async () =&gt; { await fetch('https://api.github.com/repos/${userName}/${repoName}/commits') .then((response) =&gt; response.json()) .then((data) =&gt; { id = data[0].sha.slice(0, 7) })})await fetch('https://api.github.com/repos/${userName}/${repoName}/commits')Performs a fetch request to the Github API’s. Replace this userName and repoName with yours..then((response) =&gt; response.json())Converts the response to .json objects..then((data) =&gt; {id = data[0].sha.slice(0, 7)})Assigning only the first index data[0] sha key (where our commit id is) to a variable id since our request returned an array of objects with all the commits and info.slice(0,7)Takes only the first 7 digits since it is the Git default for a short SHAFull Code", "content_html": "<h4 id=\"scroll-down-for-full-code\"><a href=\"#full-code\">Scroll down for full code</a></h4><h4 id=\"output\">Output</h4><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>commit 72ea82s</code></pre></div></div><h4 id=\"import-onmount-from-svelte\">Import onMount from Svelte</h4><p><code class=\"language-plaintext highlighter-rouge\">import { onMount } from 'svelte'</code></p><p><code class=\"language-plaintext highlighter-rouge\">onMount</code> runs immediately after the component is rendered to the DOM.</p><h4 id=\"write-a-simple-fetch-function-to-fetch-from-the-github-api\">Write a simple fetch function to fetch from the Github API</h4><p>So here we are telling Svelte to fetch some data from this API when the component is first rendered. Note that the functions inside the <code class=\"language-plaintext highlighter-rouge\">onMount</code> is only triggered when it enters the DOM.</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>onMount(async () =&gt; {  await fetch('https://api.github.com/repos/${userName}/${repoName}/commits')    .then((response) =&gt; response.json())    .then((data) =&gt; {      id = data[0].sha.slice(0, 7)    })})</code></pre></div></div><p><code class=\"language-plaintext highlighter-rouge\">await fetch('https://api.github.com/repos/${userName}/${repoName}/commits')</code>Performs a fetch request to the Github API’s. Replace this <code class=\"language-plaintext highlighter-rouge\">userName</code> and <code class=\"language-plaintext highlighter-rouge\">repoName</code> with yours.</p><p><code class=\"language-plaintext highlighter-rouge\">.then((response) =&gt; response.json())</code><br />Converts the response to <code class=\"language-plaintext highlighter-rouge\">.json</code> objects.</p><p><code class=\"language-plaintext highlighter-rouge\">.then((data) =&gt; {id = data[0].sha.slice(0, 7)})</code><br />Assigning only the first index <code class=\"language-plaintext highlighter-rouge\">data[0]</code> <code class=\"language-plaintext highlighter-rouge\">sha</code> key (where our commit id is) to a variable <code class=\"language-plaintext highlighter-rouge\">id</code> since our request returned an array of objects with all the commits and info.</p><p><code class=\"language-plaintext highlighter-rouge\">slice(0,7)</code><br />Takes only the first 7 digits since it is the Git default for a short SHA</p><h4 id=\"full-code\"><a name=\"full-code\">Full Code</a></h4><script src=\"https://gist.github.com/rohanharikr/aef6d401adc26f403efe98d6238602d4.js\"></script>", "url": "http://localhost:4000/2020/06/11/show-latest-commit-svelte", "date_published": "2020-06-11T00:00:00+05:30", "date_modified": "2020-06-11T00:00:00+05:30", "author": { "name": "rohan", "url": null, "avatar": null } }, { "id": "http://localhost:4000/2020/06/02/rock-paper-scissors-javascript", "title": "Rock, paper, scissors, javascript", "summary": null, "content_text": "Scroll down for full codeOutput// Pass a choice as an argument to the main function.You chose paper and computer chose rock.You win!Create an array of all possible choicesconst choices = [\"rock\", \"paper\", \"scissors\"]Random ChoiceThis would give us a random number between 1 and the array length which in this case happens to be 3.Math.floor(Math.random() * choices.length)Main functionThe Random Choice code is put inside a function because ideally, every time this function is called, a new choice would be generated.function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`)...}MatchmakingFirst things first, let’s consider all the tie cases.function game(userChoice) { const computerChoice = choices[Math.floor(Math.random() * choices.length)] console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`) \tif (userChoice === computerChoice) { console.log(\"It's a tie!\") }...}All the cases when your choice is rockif (userChoice === \"rock\") {\tif (computerChoice === \"paper\") { console.log(\"You lost!\") } else if (computerChoice === \"scissors\") { console.log(\"You won!\") }Repeat for other n choices; this case, twoif (userChoice === \"paper\") { if (computerChoice === \"rock\") { console.log(\"You won!\") } else if (computerChoice === \"scissors\") { console.log(\"You lost!\") }}if (userChoice === \"scissors\") { if (computerChoice === \"rock\") { console.log(\"You lost!\") } else if (computerChoice === \"paper\") { console.log(\"You won!\") }}Optimise by writing all the cases in one blockif (userChoice === computerChoice) { console.log(\"It's a tie!\") } else if (userChoice === \"rock\") { if (computerChoice === \"paper\") { console.log(\"You lost!\") } else if (computerChoice === \"scissors\") { console.log(\"You won!\") } } else if (userChoice === \"paper\") { if (computerChoice === \"rock\") { console.log(\"You won!\") } else if (computerChoice === \"scissors\") { console.log(\"You lost!\") } } else if (userChoice === \"scissors\") { if (computerChoice === \"rock\") { console.log(\"You lost!\") } else if (computerChoice === \"paper\") { console.log(\"You won!\") } }Full Code", "content_html": "<h4 id=\"scroll-down-for-full-code\"><a href=\"#full-code\">Scroll down for full code</a></h4><h4 id=\"output\">Output</h4><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>// Pass a choice as an argument to the main function.You chose paper and computer chose rock.You win!</code></pre></div></div><h4 id=\"create-an-array-of-all-possible-choices\">Create an array of all possible choices</h4><p><code class=\"language-plaintext highlighter-rouge\">const choices = [\"rock\", \"paper\", \"scissors\"]</code></p><h4 id=\"random-choice\">Random Choice</h4><p>This would give us a random number between 1 and the array length which in this case happens to be 3.</p><p><code class=\"language-plaintext highlighter-rouge\">Math.floor(Math.random() * choices.length)</code></p><h4 id=\"main-function\">Main function</h4><p>The <code class=\"language-plaintext highlighter-rouge\">Random Choice</code> code is put inside a function because ideally, every time this function is called, a new choice would be generated.</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>function game(userChoice) {    const computerChoice = choices[Math.floor(Math.random() * choices.length)]    console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`)...}</code></pre></div></div><h4 id=\"matchmaking\">Matchmaking</h4><p>First things first, let’s consider all the tie cases.</p><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>function game(userChoice) {    const computerChoice = choices[Math.floor(Math.random() * choices.length)]    console.log(`You chose ${userChoice} and computer chose ${computerChoice}.`)   \tif (userChoice === computerChoice) {        console.log(\"It's a tie!\")    }...}</code></pre></div></div><h4 id=\"all-the-cases-when-your-choice-is-rock\">All the cases when your choice is rock</h4><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>if (userChoice === \"rock\") {\tif (computerChoice === \"paper\") {            console.log(\"You lost!\")    } else if (computerChoice === \"scissors\") {            console.log(\"You won!\")    }</code></pre></div></div><h4 id=\"repeat-for-other-n-choices-this-case-two\">Repeat for other n choices; this case, two</h4><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>if (userChoice === \"paper\") {    if (computerChoice === \"rock\") {        console.log(\"You won!\")    } else if (computerChoice === \"scissors\") {        console.log(\"You lost!\")    }}if (userChoice === \"scissors\") {    if (computerChoice === \"rock\") {        console.log(\"You lost!\")    } else if (computerChoice === \"paper\") {        console.log(\"You won!\")    }}</code></pre></div></div><h4 id=\"optimise-by-writing-all-the-cases-in-one-block\">Optimise by writing all the cases in one block</h4><div class=\"language-plaintext highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>if (userChoice === computerChoice) {        console.log(\"It's a tie!\")    } else if (userChoice === \"rock\") {        if (computerChoice === \"paper\") {            console.log(\"You lost!\")        } else if (computerChoice === \"scissors\") {            console.log(\"You won!\")        }    } else if (userChoice === \"paper\") {        if (computerChoice === \"rock\") {            console.log(\"You won!\")        } else if (computerChoice === \"scissors\") {            console.log(\"You lost!\")        }    } else if (userChoice === \"scissors\") {        if (computerChoice === \"rock\") {            console.log(\"You lost!\")        } else if (computerChoice === \"paper\") {            console.log(\"You won!\")        }    }</code></pre></div></div><h4 id=\"full-code\"><a name=\"full-code\">Full Code</a></h4><script src=\"https://gist.github.com/rohanharikr/8bfbd1471389e795b436cd87ab09a444.js\"></script>", "url": "http://localhost:4000/2020/06/02/rock-paper-scissors-javascript", "date_published": "2020-06-02T00:00:00+05:30", "date_modified": "2020-06-02T00:00:00+05:30", "author": { "name": "rohan", "url": null, "avatar": null } }, { "id": "http://localhost:4000/2019/04/05/see-who-liked-you-without-tinder-gold", "title": "See who liked you without Tinder Gold", "summary": "What is the difference between various font formats?", "content_text": "ResultImages of people who liked you at 640x800, 320x400, 172x216 without Tinder Gold.SoTinder likes without Gold comes up like this, a blur effect on the photo(s). \tInitially, I thought that the blurred images were sent from their servers itself.A simple inspection on the code-webkit-filter: blur(8px)filter: blur(8px)Okay, so they are applying a blur effect with CSS. Disabling this would give me a raw image of 172x216 dimension. Exploring media items, the recently liked (only one) would be of 320x400 dimension.https://preview.gotinder.com/18d6e533-c874-48ad-ac66-ae6b63aa77fb/172x216_c77f0e5c-40b4-4af4-9b68-5f0ff26ead90.jpgThe 172x216 in the URL is the dimensions. Changing it to 320x400, would give me an image of that dimension. All the images were coming from the same endpoint. So, I tried changing it to random dimensions with the same aspect ratio which like I guessed didn’t work because they were not storing (x dimension) in their server.Also, noticed that my profile picture was of better quality.To my surprise, that too was coming from the same endpoint. So, now I know that Tinder stores images in 640x800 also.So, that’s that.", "content_html": "<h4 id=\"result\">Result</h4><p>Images of people who liked you at 640x800, 320x400, 172x216 without Tinder Gold.</p><p><img src=\"../../../assets/images/result.png\" alt=\"\" /></p><p><br /></p><h4 id=\"so\">So</h4><p>Tinder likes without Gold comes up like this, a blur effect on the photo(s).</p><p><img src=\"../../../assets/images/tindergold.png\" alt=\"\" /> \tInitially, I thought that the blurred images were sent from their servers itself.A simple inspection on the code</p><div class=\"language-html highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>-webkit-filter: blur(8px)filter: blur(8px)</code></pre></div></div><p>Okay, so they are applying a blur effect with CSS. Disabling this would give me a raw image of 172x216 dimension. Exploring media items, the recently liked (only one) would be of 320x400 dimension.</p><div class=\"language-html highlighter-rouge\"><div class=\"highlight\"><pre class=\"highlight\"><code>https://preview.gotinder.com/18d6e533-c874-48ad-ac66-ae6b63aa77fb/172x216_c77f0e5c-40b4-4af4-9b68-5f0ff26ead90.jpg</code></pre></div></div><p>The 172x216 in the URL is the dimensions. Changing it to 320x400, would give me an image of that dimension. All the images were coming from the same endpoint. So, I tried changing it to random dimensions with the same aspect ratio which like I guessed didn’t work because they were not storing (x dimension) in their server.</p><p><img src=\"../../../assets/images/error.png\" alt=\"\" /></p><p>Also, noticed that my profile picture was of better quality.</p><p><img src=\"../../../assets/images/profile.png\" alt=\"\" /></p><p>To my surprise, that too was coming from the same endpoint. So, now I know that Tinder stores images in 640x800 also.</p><p>So, that’s that.</p>", "url": "http://localhost:4000/2019/04/05/see-who-liked-you-without-tinder-gold", "date_published": "2019-04-05T00:00:00+05:30", "date_modified": "2019-04-05T00:00:00+05:30", "author": { "name": "rohan", "url": null, "avatar": null } } ] }</section></main></body></html>
